[{
    "datetime": "30-mar-2018",
    "questions": [
        {
            "q": "@bouhlalnadia: hi there please help me with my last issue in memory game project it took me too many days<br>the problem is that the cards shuffle correctly in refreshing but only if I hit restart i cant play the game<br>like i cant flip the cards<br>what may be the cause?  the same function init is used in the global scope<br>and in restart",
            "a": "@david: Where is  your restart function being called?<br>@bouhlalnadia: it is in an eventlistener when i click repeat button<br>@bouhlalnadia: ```repeat.addEventListener('click', restart);\nrepeat.addEventListener('click', init);```<br>@david: If both of those are included as listeners, you might actually have a race condition where one finishes before the other (and not in the right order).<br>Really, you don't need separate methods for restarting and init. They should be the same process. So a single function should be triggered when the event is fired.<br>@bouhlalnadia: i called init at the end of restart and it is the same<br>@bouhlalnadia: problem<br>@bouhlalnadia: and also with restart within init<br>@david: You should just have a single function  that clears everything that's already there and sets the board the way that it should be. Having two functions is going to be problematic. <br>@bouhlalnadia: ah ok it may be true thank u for the help and bearing with me<br>@bouhlalnadia: i know i became heavy but this problem really stresses me<br>@david:Sure. I completely understand. Programming can be like that sometimes.<br>@bouhlalnadia: i imagine the problem as after the click event on restart the parser does not go on until the end where there is the eventlistener on clicking the cards<br>@bouhlalnadia: is this possible to occur?",
            "attach": "uploads/restart.png,uploads/restart1.png",
            "track": "javascript"
        },
        {
            "q": "@Mason-Wu: I am having trouble understanding how to reference relative commits when trying to use `$ git reset` in Lesson 15.",
            "a": "@Mason-Wu: 1) What is the difference between `^` and `~`? In other words, what is the difference between the *'parent commit'* and the *'_first_ parent commit'*?<br>2)With a merge commit, the `^` reference is used to indicate the first parent of the commit while `^2` indicates the second parent.<br>Doesn't this contradict the definition of `~` as the first parent?<br>3)```* 9ec05ca (HEAD -> master) Revert 'Set page heading to 'Quests & Crusades'\n* db7e87a Set page heading to 'Quests & Crusades'\n* 796ddb0 Merge branch 'heading-update'\n|\n| * 4c9749e (heading-update) Set page heading to 'Crusade'\n* | 0c5975a Set page heading to 'Quest'\n|/\n* 1a56a81 Merge branch 'sidebar'\n|\\ \n| * f69811c (sidebar) Update sidebar with favorite movie\n| * e6c65a6 Add new sidebar content\n* | e014d91 (footer) Add links to social media\n* | 209752a Improve site heading for SEO\n* | 3772ab1 Set background color for page\n|/\n* 5bfe5e7 Add starting HTML structure\n* 6fa5f34 Add .gitignore file\n* a879849 Add header to blog\n* 94de470 Initial commit\nWhich commit is referenced by HEAD~6?\n209752a```<br>It appears that only the `*` commits in the log are counted in the reference.<br>Is that because they are all in the master branch that git is pointing to?<br>What do all those symbols on the left mean?<br>4) Why can't we just reference commits with their SHA's and avoid this excessive syntax?<br>@david: 1&2) The explanation on this page is pretty clear: https://stackoverflow.com/questions/2221658/whats-the-difference-between-head-and-head-in-git<br>It comes down to the fact that commits can have more than one parent. It has a great illustration for how these two things can work. <br>3) Yes, and the symbols are indicating the branching history of the previous commits. The lines point to different branches, and the stars indicate which of those branches the commit was on.<br>4) You can. Many people do.<br>@Mason-Wu: Thank you for the response as well as the helpful links! I'll be sure to take a look over them soon.",
            "track": "github"
        },
        {
            "q": "@Antonis:<br>Hello! I would like to ask about a warning that I see on Google Chrome and if it affects in any way the things that we learn here on fend. Thank you.<br>And here is the warning:<br>[Deprecation] Styling master document from stylesheets defined in HTML Imports is deprecated, and is planned to be removed in M65, around March 2018. Please refer to 'https://goo.gl/EGXzpw' for possible migration paths.",
            "a": "@david: Nope we don't cover HTML imports at all - it's not a common practice.<br>@Antonis: Thank you for your reply!",
            "track": "html"
        }
    ]
},
{
    "datetime": "28-mar-2018",
    "questions": [
        {
            "q": "@Patrícia: Hi! what kind of questions can we ask here? can it be questions regarding doubts in our code for a project?",
            "a": "@david: Sure! Just keep in mind there are a lot of students and I'm doing office hours in four different channels right now. We'll be able to help with some things, but more complex issues should be worked out with your mentor, in the classroom chat, here in Slack or on your own.<br>@Patrícia: ok thank you! i'll post it here but I'm trying to figure it out also with my mentor and colleagues.",
            "track": "n/a"
        },
        {
            "q": "@Josh_B: @david is there anything being planned to revitalize this Slack community as an open source of feedback/communication? If not, is there somewhere else I should be looking?<br>I feel like there should be much more activity for channels with 10's of thousands of people (across many different timezones no less), and yet I very often see people posting questions and getting 2-3 responses.",
            "a": "@david: Hey Josh, the members of this Slack also include a lot of students who aren't active any more. _But_ we're definitely working on some plans to increase engagement in all of our communities.<br>@david: Keep in mind, too, that not everyone will be active at the same time of day as you. We have a lot of students in different places around the world.<br>@Josh_B: Totally understood, just seems a little devoid of traffic, even coming back to revist a question 24-48 hours later. I hope to see more engagement in the future for sure. Thank you for taking the time to reply!<br>@veronika: @Josh_B Have you been using the chat feature in the classroom? Some students may be using chat more and that's why we're seeing less action in Slack.<br>@Josh_B: Are you talking about chat with the mentor? Or chat somewhere else?<br>@veronika: The latest version of FEND has a chat feature where students can talk to each other inside the classroom instead of talking on Slack.<br>@Josh_B: That that would be nice. I don’t think I have that. I am on track to finish the 2nd project within it’s due date of Apr 6th. Unsure which “version” of FEND that is?<br>@Josh_B:@david is there anyway to be bumped up to the newest version if I’m not in it so I can take advantage of this feature? that would be awesome.",
            "track": "n/a"
        },
        {
            "q": "@Patrícia: Hi! I'm doing the pixel art maker with plain JS (I already did it with jQuery) but now I can't apply the selected color and I can't understand why this is not working :disappointed: can someone take a look to my code please? I'd be very greatful :slightly_smiling_face: https://codepen.io/Snowii/pen/dmJXZb",
            "a": "@adkuca: ```e.target.style.backgroundColor = color;```<br>@david: You might want to try using `console.log(e.target)` to see what your element actually looks like. <br>You might be surprised to see that you aren't actually using the value of `color` anywhere.<br>@adkuca: but if you really want to use the attribute way and add it into html which is not... prefered<br>@adkuca: ```e.target.setAttribute('style', 'background-color: ' + color);```<br>@adkuca: or<br>```e.target.setAttribute('style', `background-color: ${color}`);``` <br>@Patrícia: thank you @David i'll keep in mind to use more often the console log to check for this kind of things<br>@Patrícia: and thank you @adkuca for tour help on the different ways to do this",
            "track": "javascript"
        }
    ]
},
{
    "datetime": "23-mar-2018",
    "questions": [
        {
            "q": "@Malak-Joseph: I don't know whether it's the right place to ask about the mentor, but just gimme a quick tip of what to do since he isn't reply for 10 days now.",
            "a": "@david: Hi @Malak - please send a message to mentorship-support@udacity.com. Your mentor should reply to you within about a day, so they'll want to look into that.",
            "track": "n/a"
        },
        {
            "q": "@Andrew: hi, can someone explain the concept of a ‘wrapper’ class in javascript that is used to wrap another class and act as an intermediary between the wrapped class and a third party library?  thanks",
            "a": "@Andrew-W: Hi @Andrew, thanks for writing in. Where have you seen this in the curriculum?<br> @Andrew: hey @Andrew W it came up in a project i’m working on outside the curriculum and i thought this would be a good place to ask. no worries if it’s outside of the scope of the program<br> @david: Hey @Andrew - It sounds like what you're talking about is the idea of inheritance - where you have a new class that is a superset of a base class. <br>That's a pretty common practice in most OOP languages. It works a _little_ differently under the hood in JS, because of the Object-first nature of the language, but overall it's generally the same idea.<br> @Andrew: thanks @David i’ll take a look at inheritance again",
            "track": "javascript"
        }
    ]
},
{
    "datetime": "21-mar-2018",
    "questions": [
        {
            "q": "@Homero-Barbosa: random question, is there any plans to offer again the senior front end nanodegree? I'm already half way on this one",
            "a": "@richard: Hello @Homero-Barbosa The Sr. Web Developer Nanodegree program won't be making a comeback, but a number of courses were transitioned from it into FEND.<br>And we're always planning content improvements and new potential programs. Feel free send a list of things you're interested in learning<br> @Homero-Barbosa: sad to hear that... do the courses it had still available?<br> @richard: Like I said, some of the courses are in FEND now:<br>• Front-End Frameworks<br>• High Conversion Web Forms<br>• Offline Web Applications<br>• JavaScript Promises<br>• Client-Server Communications<br>@richard: But all of the courses are available in our catalog: https://www.udacity.com/courses/all",
            "track": "n/a"
        },
        {
            "q": "@valeria.kori: Memory Game Project: I want to add the current ittaration of a counter to the innerHTML/Text of the span that holds the number of moves. I get the numbers to log correctly to the console, but I struggle to append that value to the span. Should I be using innerHTML or innerText or something else?",
            "a": "@richard: Either `.innerHTML` or `.innerText` should do what you want.<br>Are you getting any errors in the console when you try to use them?<br> @valeria.kori: Alright, so just like you taught in the course on creating content<br>I do not get an error, I log moves.innerHTML and it prints or the right number at the right time but I struggle with assigning that value to the according span<br> @richard: Are you accessing the right `span` element? Remember that you can log out the span element in the console to make sure you're accessing the correct element.<br> @valeria.kori: Thank you for coming back to my question. Fortunately I figured it out by now, I was indeed selecting an array of elements instead of that span alone",
            "track": "html"
        },
        {
            "q": "@Andrew: hey @Andrew-W and co. i’m finishing up the search function of the myBooks React app and i’m stuck on comparing the id’s of the search results vs the id’s of the books already on the shelves.",
            "a": "@Andrew: in other words, how to check if an object property in one array of objects exists in another array of objects<br> @Andrew-W: Hey Andrew, it sounds like the approach you're taking is deep comparison?<br> @Andrew: i’m not perfectly familiar with that term, but i thinks that’s correct via a for loop",
            "track": "javascript"
        },
        {
            "q": "@alianza: Hi @Andrew-W! For the past several months now, I have had one mentor, but I just received a notification last night that I now have a new mentor! I really liked the mentor that I had before, and I was wondering if it's possible for me to find out what happened",
            "a": "Andrew-W:Hey @alianza! Long story short: A few mentors were over capacity, so we recently did a reassignment of students and mentors to balance things out.<br> @Andrew-W: I encourage you to keep the conversation going with your current mentor, but if you have any questions, feel free to reach out on react-support@udacity.com<br>@alianza: Thank you so much for letting me know! @Andrew-W<br> @Andrew-W: Very glad to hear that you're connecting with your mentor in the first place btw :+1:. You're not in this course alone!<br> @alianza: Yes, that's definitely the good part about this mentor program! I just hope my new mentor is as good as my old mentor lol<br> @Andrew-W: @alianza I have no doubt that you'll have great chats with your new mentor! They're good peeps",
            "track": "n/a"
        }
    ]
},
{
    "datetime": "16-mar-2018",
    "questions": [
        {
            "q": "I have question here #office-hours  | If i am using picture elment with source & srcset and with that tag give me error with validation html5 code how to pass it ?",
            "a": "@david: What error are you getting?<br> @Husien-Adel:give me error for using picture element and repeating srcset for 1x & 2x ..etc ?<br> @david:Do you have your code on GitHub?<br> @Husien-Adel:yes i have one but i modified it as i am using only now img with src ?I am asking only is there a problem for using picture tag with source and multiple srcset in html5 validation ?<br> @Alain:no you can pass the validation with srcset, you must be doing someting wrong<br> @david:Yeah - there's nothing about that set up that would cause validation errors unless your HTML is actually invalid for some reason.",
            "track": "html"    
        },
        {
            "q": "Hi! I have a question about the bootstrap, what is an actual difference between col-12 and d-flex...",
            "a": "'col-12' is class used to define what portion of a row an element should take up (there are 12 'columns' in a row.)<br>`d-flex` represents a container using flexbox.<br>Flexbox elements have some specific capabilities that aren't available with other layout elements.<br>@Tonia: Thank you!<br>When would you recommend using Flexbox?<br>Also I am confused what flexbox is. Is it that bootstrap is using flexbox, which we can use also separately...?<br> @david: Yes, exactly!<br>Flexbox is a set of CSS attributes that can be used for flexible layout design.<br>I really like this overview here: https://css-tricks.com/snippets/css/a-guide-to-flexbox/<br> @Tonia: Thank you!! I will read it!<br>So what do I gain from using a bootstrap? Is it just that it is easier?<br> @david: It provides a very specific structure for site layouts and it's really easy to get something put together quickly that doesn't look terrible.",
            "track": "css"            
        }
    ]
},
{
    "datetime": "14-mar-2018",
    "questions": [
        {
            "q": "@abdo.esam2011: cool, i wonder how to generate pics for media queries , should i learn gulp for that?  or there is another way?",
            "a": "@david: Gulp is great for that - there are some webpack plugins that can help with image management as well. <br>You could also just do the compression and resizing yourself - that's a time consuming task though, and I think the benefit of spending that time practice with a build tool like Gulp or Webpack would be better.<br> @abdo.esam2011: @david yes so i can skip gulp and learn webpack it will make the job done?!<br> @david: You'll need to do some research online to find the best tools to use with webpack, but yes, that's a good strategy.",
            "track": "n/a"
        },
        {
            "q": "@RodrigoC: Hey @david I'm having a mental block trying to get rid of an issue on the memory game. I've a click `eventListener` and when I click on a tile an ID I have assigned to the `li` element is pushed to the array. However if I click a card that is opened or double click this will be assigned as the second value and compared and obviously it is the same card so it will return true and the card will stay open. I've tried comparing the element but I'm struggling with ideas to identify this particular element since it will be identical to the one that it matches and every form I think of would prevent the match. I think I'm a bit burned out with this memory game now. Are there any ideas or places you could suggest that I could look into? Thank you.",
            "a": "@david: Hey Rodrigo! One strategy that some students have found useful is to add a unique class or id to each element using JS. You can use also just use a CSS class like 'flipped' to make sure that the click event only triggers if the card is not flipped. <br> @RodrigoC: Yes I'm using an ID to compare it I was just about to try with setAttribute and add an attribute to the li but I'm thinking all this code isn't very efficient.<br> @RodrigoC: thank you for your reply. I will keep at it.<br> @david: UI code is _often_ inefficient - but, since you're generally working with small amount of data, you don't really lose much from the inefficiencies.",
            "track": "javascript"
        },
        {
            "q": "@MohammedRiaad: <br>if i want to save my log of users who use the game in a text file using javascript  what shall i do<br>like if i have an input of text where the user write his name to start the game  and at the end i want to show the user the wall of fame or users who played the game and number of moves and time",
            "a": "@david: If you want to show that kind of data, it will require a back-end server to store it. <br>That's a bit outside the scope of this program, but it's something that you could learn from our Full Stack Web Developer Nanodegree program.<br> @MohammedRiaad: but if i want it to be stored in the local storage in a text file<br> @david: You would only be able to store the people who have played the game from _that_ computer.<br> @david: But, if that's what you're wanting to do, the documentation for local storage is here: https://developer.mozilla.org/en-US/docs/Web/API/Window/localStorage",
            "track": "javascript"
        },
        {
            "q": "@MohammedRiaad: why when i encrypt my js file dont work",
            "a": "@david: I'm not sure I understand, but if you're encrypting your JS file, your browser can't read it.<br> @MohammedRiaad: yes<br> @MohammedRiaad: when i do so file crash and dont work<br> @david: You can't serve encrypted files. The computer will see it as garbage and won't be able to interpret what to do with it.<br> @MohammedRiaad: but if i want to share it with some one and dont want him to know that am writing inside<br> @david: There's not really a way to do that. There are no secrets on the internet. If you send someone a JS file, they will have access to the entire file.<br> @MohammedRiaad: can i ask u some thing far from the cousre<br> @david: Sure<br>@MohammedRiaad: i work with hypred applications like ionic , and i have my own Api<br> @MohammedRiaad: how i can handle the request from the api to the interface<br> @david: JavaScript has some built-in tools for handling API requests asynchronously. That's covered in a later part of the course as well. It's covered in the 'Front End Applications' part of the program.<br> @MohammedRiaad: i saw that part using react<br> @david: The React part is later, but before that there are some sections covering async javascript using the built-in XML HTTP Requests object and the newer `fetch` interface.<br> @MohammedRiaad: really didnt know that",
            "track": "javascript"
        }
    ]
},
{
    "datetime": "09-mar-2018",
    "questions": [
        {
            "q": "@Stephanie-Oliveira: Hi @david! I have a lot of difficulty to understand how to work and use `img srcset`. Most of the content that I was reading it was a bit confusing. Do you know any video on YouTube that could help?<br>Also about Grunt. I didn't even try to install it, but they that it helps a lot. Any tips for that as well?",
            "a": "@david:<br>Good questions - I would actually recommend using Gulp or Webpack over Grunt, just because those two are more frequently updated. <br>I don't know of any videos specifically that I would recommend for those, but if you're wanting more information, the best place to start is literally just a Google search for 'how do I use...' <br>There are a ton of resources out there for each of those things.",
            "track": "html"
        },
        {
            "q": "@Pascal: Hi @david, I just submitted my arcade clone. I used gulp and babel for this but in the output folder the js files use strict was used. Now i got this email back saying the following.<br>Your reviewer was unable to review your submission. Please read your reviewer's comments and then resubmit.<br>and the comment contained<br>Unable to review<br>Your project could not be reviewed. Please resubmit after you address the issue noted by the reviewer.<br>Found 2 JSHint Errors in file: Calexxxxx-frontend-nanodegree-arcade-game-1b40d8f/docs/js/resources.js<br>Error:W097 on line: 1 - Use the function form of 'use strict'.<br>Is there a way to make babel not use strict in the output?",
            "a": "@david: This StackOverflow question is probably a good place to start for that: https://stackoverflow.com/questions/33821312/how-to-remove-global-use-strict-added-by-babel<br> @Pascal: ok but files with use strict are not allowed to submit? because that's nowhere written or i completely missed that part",
            "track": "javascript"
        }
    ]
},
{
    "datetime": "07-mar-2018",
    "questions": [
        {
            "q": "@Antonis: Hello! I would like to ask something about GitHub. Can we make changes to the project repository after the project has been successfully reviewed by a mentor?",
            "a": "@Andrew-W: Hey @Antonis, thanks for checking in. Just to be clear, you mean after successfully passing a project?<br> @Antonis: Yes, exactly. Can we make changes after passing the project or should we leave it just as it was when we submitted it for the review?<br> @Andrew-W: @veronika can correct me if I'm wrong, but as I see it, it's _your_ repo. I've seen students create additional features (e.g., adding auth, etc.) to their projects after a successful submission. Once you pass, feel free to make additional commits<br> @Andrew-W: Your previous commits will still be there, anyways<br>@Antonis: Thank you for your reply!<br> @veronika: Hi @Antonis, yes, we encourage you to keep working on your projects and implement additional features. After you've passed a project, you won't be able to resubmit it for review, but its status won't change based on any changes in the repo.",
            "track": "github"
        },
        {
            "q": "@chrisrb83: Hi @Andrew W, do you mind taking a look at my question above about getting the sidebar to toggle in my React app?",
            "a": "@david: I'm taking a look at this right now.<br> @david: You need to close the header component before trying to add the sidebar component.<br> @david: You have:<br>```<Header\ncallback={props.setSidebar}\n>\n{props.sidebarVisible && <Sidebar\nmarkers={props.filteredMarkers}\ncallback={clickList}\nfilter={props.filterList}\nmarkerOpen={props.markerOpen}\nsetMarkerOpen={props.onMarkerOpen}\n/>}\n</Header>```<br>and it should be:<br>```<Header\ncallback={props.setSidebar}\n/>\n{props.sidebarVisible && <Sidebar\nmarkers={props.filteredMarkers}\ncallback={clickList}\nfilter={props.filterList}\nmarkerOpen={props.markerOpen}\nsetMarkerOpen={props.onMarkerOpen}\n/>}```<br> @chrisrb83: ahh yes of course. thank you for pointing that out!",
            "track": "react"
        }
    ]
}
]