[{
    "datetime": "14-jun-2018:04-05 PM CET",
    "type": "tehnical",
    "questions": [
        {
            "q": "RuthyW.L.:<br>Hi Edoh<br>-Def great to see you<br>-I wonder if overlapping divs in flex design<br>-when resizing the screen<br>-is an issue others bumped into?<br>-I can't seem to solve it using more media queris since it looks like I'll need one for every 20-30px of change<br>-I think this is something I coded wrong<br>-my code has the container set to flex, wrap, <br>-justify conent to center and align items to center<br>-children are set to flex<br>-What did I miss?<br>-Actually,the issue is between CONTAINERS<br>-from what I just realized- the conteiners are overlapping.<br>-not the divs inside them<br>-How could I prevent this from happening?",
            "a": "edoh: Hi Ruthy!<br>Well, flex design is meant to make designing easy especially when it comes to responsive. <br>Overlapping of divs is something every designer experience. But sometimes it can be prevented by a careful planning ahead of the coding itself.<br>But the general layout for a flexbox design is to set the container with the following:```display: flex; \n flex-wrap: wrap;```<br>and then the width of the children are adjusted for each media query breakpoint<br>```{ \n width: /* whatever you want*/ \n }```<hr>Saleh:<br>-here is an example of working flex design on different viewports with no overlapping.https://codepen.io/omerillo/pen/JGjOKN",
            "track": "fend"
        },
        {
            "q": "Diana Vilé: <br>For restaurant review project, is it needed to install Python? I tried many ways today without succeeding. Via gitbash Windows and in visual Studio code. Also not sure how to setup local server 8000 port If this is not working.",
            "a": "edoh: <br>If you are using Windows, you might need to install python. I use linux on which python is installed by default. But there is also an npm module which does the same thing as the python command: `python3 -m http.server 8000`<br>You can install it globally `npm install http-server -g` and then after you can serve a repository with the command `http-server -c1 [name of repository]` most of the time I use `c1` to prevent caches issues. You can have a look at the npm module here: https://www.npmjs.com/package/http-server <hr>Doki:You don't need python for Restaurant Review, simply install the http server edoh suggested and than use git bash on the project folder and run `http-server -p 8000`<hr>Silvia:<br>What if the port 8000 is blocked/used of some other app? I have such a problem and I am going to use a different port, but I  am wondering if there is a way to free 8000...<hr>Doki:<br>You don't have to use port 8000, and if you want to free port 8000 'which really you don't need to do' you have to end the process that uses the port, ea you have a server that is running on port 8000",
            "track": "fend"
        },
        {
            "q": "Jon:<br>Not sure if im asking the question in a way that makes sense but here it goes: How can I use the triggering of an event as a condition in 'if statement? Right now I use  `setTimeOut` to keep two cards opened for a second and then close them.  Right now the function that flips the cards  is called by an event listener that fires if there are less than two cards opened, which means users cant click on a third card, however,  I want to be able to 'listen' for the event listener being triggered so that if two cards are opened and the user clicks a third one, those opened cards close immediately an the third done opens so that the user doesn't have to wait for 1 sec for the cards to be closed automatically. <br>Here is my repository https://github.com/SrSalvaje/memorygame .",
            "a": "edoh:<br>Unless you use the if condition directly in the event function itself, there is no way is Js ( to my knowledge) that you can set a triggering event as a condition of an if statement. <br>`setTimeout` return a  positive integer that you might use to close the cards earlier than the timer if there is a new event that is fired to flip a third card. For that you will have to call `clearTimeout`<hr>Jon:<br>Ah! Excellent<hr>Doki:<br>If you want to go in depth about triggering events like that there is a neat little tutorial you can follow that shows you the complete code snippet by snippet and explains how it performs it will explain what you want 'listening for the clicks of two cards' https://courses.edx.org/courses/course-v1:Microsoft+DEV234x+1T2018a/courseware/d2230f74f2ec482cace613dcf2f68532/360f7885334f4755b85541e32206a259/2?activate_block_id=block-v1%3AMicrosoft%2BDEV234x%2B1T2018a%2Btype%40vertical%2Bblock%40f4baaa47e5614adc9271e017ec35c4dd<br><hr>Doki<br>You will have to have an edx account and than enroll into the asynchronous javascript course 'it's free' than click at my link and you'll see it",
            "track": "fend"
        },
        {
            "q": "AlexP: <br>Hi … How can I make the timer to stop? I set clearInterval(liveTimer); but still runs https://github.com/alicu90/Memory_Game.git",
            "a": "edoh:<br>`clearInterval` is the only way to make the time to stop if it has been created with setInterval. Maybe that you have other issues with some logics in your code<hr>cveiga:<br>you use two times the same function stopTimer line 138 and line169 too...one you used clearIntreval(incrementer) and in the other you used clearInterval(liveTimer) <hr>edoh:<br>I wish you put here relevant part of your code so that it might be easier to spot the mistake. Can you please make the public display of your code by going in settings => github pages?",
            "track": "fend"
        },
        {
            "q": "Beatrice: <br>I know it's a bit of topic question, but I would like to ask about MVP pattern. Which approach the student has to take to learn it? What is the challenge learning it? Are there any good resources for learning it? What advice would you give for someone who is trying to learn it?",
            "a": "Sudha:<br>Hi Beatrice, I am also a student like you. According to my experinece, by placing the java file seperate , resources seperately wekind of follow the Model view Presenter model in android studio. I would advice you to concentarte on learning the android fundamentals to start with.<hr>Oya:<br>Jose have recently added a chapter on Android Architecture Components to the Developing Android Apps free course. You can start with that one. @Beatrice<hr>Ahmad:<br>The MVP architecture is used to make the changes to project easier <br>By making a package to deal with data (files, database, internet connection,api,...)  which is the model  No validation to the data made here<br>Another package to validate the data coming from the model and when it's done it tells the activity/fragment that there is data or there is an error ....<br>Finally the view which is the interface that the presenter will call to notify the activity<br>It's used to easily change the code so when you want to use a retrofit library to get the data from the Internet you will need to change only the class in model package which is responsible for grabbing the data and it's also better for unit test(I don't know what it's)<br>I only used it once <br>And that all I knew about it",
            "track": "and"
        },
        {
            "q": "Bogdan:<br>What's the best way to store a drawable at different densities?",
            "a": "Sudha:<br>I would suggest you to use a vector drawable because they are scalable and the occupy less space compared to png and other formats<hr>Liron YA.:<br>Hey @Bogdan, did you try the android drawable importer? It's a plugin<hr>tam:<br>Great answer @Sudha! In the cases where you can't use a vector drawable (or it's less practical) there's great software like figma.com which makes it super easy to export drawables at the size you need and then you can just add them to the different drawables folders in your project, or use what @Liron YA. has just mentioned <hr>Bogdan:<br>thank you.<hr>Oya:<br>But vector drawables are good only for small images like icons. For large images it is not a good idea. Yes, they are small files on the disk, but they are drawn on run time, so they can consume a lot from run time memory.<hr>Bogdan:<br>@Oya so for images displayed in list elements I should not use them?<hr>tam:<br>.png 's are ok to use too when vectors aren't the best option, there's ways to keep png file sizes small like https://tinypng.com/<hr>Oya:<br>If it is a small icon, that might not be a problem. But if we are talking about photos or more complex images, I would avoid vector drawables.<hr>Ahmad:<br>I use this https://github.com/asystat/Final-Android-Resizer. It's executable jar that resizes the images for you. Just specify the input image density and it will generate the image for other densities",
            "track": "and"
        },
        {
            "q": "wiktorl4z: <br>What's is the best way to pass interface into fragment, by constructor or in onAttach() method?",
            "a": "nuhkoca: <br>Hi @wiktorl4z thanks for the question. You could pass interfaces over constructor. However there are some points you need to care about. For example, in onAttach method you should assign your activity to interface as a reference like;`*mIErrorCallbackListener = (IErrorCallbackListener) getActivity();*`<br>and in onDetach you have to dispose it like; `*mIErrorCallbackListener = null;*` <br>to avoid memory leaks<hr>Janekxyz:<br>I think it's depends on situation. I more often pass interface with constructor, or if I can I implement it in fragment and then send response to Activity or wherever you want. (edited)<hr>wiktorl4z:<br>so this is how its looks like in our sample fragment project<hr>wiktorl4z: https://imgur.com/a/9sZGQB1<hr>nuhkoca:<br>yes, and in onDetach you should;<br>```@Override\n public void onDetach() {\n mIErrorCallbackListener = null;\n super.onDetach();\n }```<hr>wiktorl4z: <br>but in this project I dont see anything about onDetach<hr>wiktorl4z: <br>okey thanks good to know :+1: @nuhkoca<hr>nuhkoca: <br>@wiktorl4z are you sure? onAttach and onDetach there for Fragments can you please try again?<hr>wiktorl4z: <br>@nuhkoca https://imgur.com/a/W0RLuSL<hr>nuhkoca: https://imgur.com/a/QXtOqxy<hr>nuhkoca: <br>I can override it<hr>wiktorl4z: <br>yeah, I know. But why don't we have this in our sample code?<hr>nuhkoca: <br>usually they leave it to us :slightly_smiling_face:<hr>wiktorl4z: <br>Imho they forgot about it, because I haven't seen in solution code the onDetach <br>anyway good to know!",
            "track": "and"
        },
        {
            "q": "Rhm:<br>what is the best way to make clean and good presentable code ?",
            "a": "Hi @Rhm, I think you should comment your code because for you it can be understandalbe but for other it could not be as good to read as for you. <br>I think that this question was answered many times on internet and you can take a look at this article:            <br>https://medium.com/mindorks/how-to-write-clean-code-lessons-learnt-from-the-clean-code-robert-c-martin-9ffc7aef870c<br>Hope it helps and after read it you will be more aware of clean code<hr>nuhkoca:<br>There are some point that I can offer<br>1. Try using a specific and precise naming conventions<br>2. Try saying what you mean --> write understandable function and variable names<br>3. Try having whitespaces between code blocks and add comments<br>4. Try having OOP approach<br>5. Try using the latest techs because these are all developed for a better coding experience<br>6. Try automating processes --> Have a Util class for most common processes so that you can avoid boilerplates (edited)<hr>Tom:<br>Uncle Bob's Clean code book also has some really great advice :slightly_smiling_face:<hr>nuhkoca:<br>@Tom absolutely!<br>Also this is good<br>https://www.amazon.ca/Clean-Code-Handbook-Software-Craftsmanship/dp/0132350882",
            "track": "and"
        },
        {
            "q": "Berenice: <br>Hi all, Is anyone familiar to -.htaccess files and code in order to allow access to specific file types on a server? It is not a really Android related question …",
            "a": "Janekxyz:<br>Hi @Berenice, yeah it's not related with Android. When I was studying I had to write some commands in .htaccess but I'm afraid that I can not remember it as good as I wanted to remember<hr>nuhkoca:<br>I just used .htaccess for hacking some software in my highschool ages <hr>Berenice:<br>I have tried```<FilesMatch '\\.(unityweb)$'> \n Order allow, deny \n Allow from all \n </FilesMatch>```<br>I really don’t know what the code should look like.<br>However, the above code does 'not' work, as absolutely no content will be shown. Even the landing page will not work. <hr>nuhkoca:<br>@Janekxyz do you have an idea?<hr>Janekxyz:<br>@Berenice Do you want to disable only some types of files all files inside directories?<hr>Berenice:<br>The 'code' looks weird. I will look for a tutorial.<hr>Berenice:<br>@Janekxyz I want to *allow* access to all files of the type  -.unityweb<hr>Janekxyz:<br>@Berenice I think that your regex isn't working as you want it to work<hr>Janekxyz:<br>I would say that you should make something like this: <hr>Janekxyz:```<FilesMatch '\\.unityweb$'> \n Allow from all \n </FilesMatch>```<hr>Janekxyz:<br>But I'm not 100% sure if this changes anything<hr>Berenice:<br>@Janekxyz I will try it. Thank you!<hr>Berenice:<br>@Janekxyz It is working !!! thanks!",
            "track": "and"
        },
        {
            "q": "fif.iva:<br>Hey all, thanks for this tech AMA and for your time! <br>I was wondering what is the best way of handling internet connectivity in an app? In my last projects I was only handling this within my `onFailure()` method using Retrofit. The projects met specifications, but I still think it's not the best way of handling this. Is that right?",
            "a": "Berenice:<br>Good question. I think it depends on how often you want to notify the user. If his connection is really unstable , I would not want to show a notification each time the connection gets lost.<hr>fif.iva:<br>Thanks @Berenice, hmm you're right here! I just noticed, while handling this only with the onFailure() method, if I open my app without connectivity with cached information, it didn't show correctly that the user doesn't have internet connection and I think this could be confusing to the user. <hr>Janekxyz:<br>Hi @fif.iva, It always depends First of all you should check internet connection with:```private boolean isNetworkAvailable() {\n ConnectivityManager connectivityManager \n = (ConnectivityManager) getSystemService(Context.CONNECTIVITY_SERVICE);\n NetworkInfo activeNetworkInfo = connectivityManager.getActiveNetworkInfo();\n return activeNetworkInfo != null && activeNetworkInfo.isConnected();\n }```<br>I think you should be aware of http response codes: https://en.wikipedia.org/wiki/List_of_HTTP_status_codes <br>and try to deal with most popular response codes. <br>I think that Retrofit onFailure is a nice place to get response code and then depends on it you can choose few things like Snackbar, Toasts etc to inform user that something went wrong.```public class InternetReceiver extends BroadcastReceiver {\n \n @Override\n public void onReceive(Context context, Intent intent) {\n \n if (isConnected())\n  Log.d('NetReceiver', 'Internet is connected');\n else\n Log.d('NetReceiver', 'Internet is not connected');\n }\n \n public boolean isConnected() {\n \n Runtime runtime = Runtime.getRuntime();\n try {\n Process ipProcess = runtime.exec('/system/bin/ping -c 1 8.8.8.8');\n int exitValue = ipProcess.waitFor();\n return (exitValue == 0);\n \n } catch (IOException e)\n { Log.e('ERROR', 'IOException',e); }\n catch (InterruptedException e) { Log.e('ERROR', 'InterruptedException',e); }\n \n return false;\n }\n };``` <br>I have found this code somewhere in internet when I was looking for solution. Working perfect<hr>Berenice:<br>Then, I would just show a Toast or Snackbar message once in the onFailure() method. But, I think we would have to check first whether it is really related to a network connection problem of the device.<hr>Berenice:<br>I used so far a very basic script. For my capstone I have to differentiate a bit more.```public class ConnectivityUtil {\n \n public static boolean isConnected(Context context) {\n ConnectivityManager connectivityManager = (ConnectivityManager) context\n .getSystemService(Context.CONNECTIVITY_SERVICE);\n \n NetworkInfo networkInfo = connectivityManager.getActiveNetworkInfo();\n \n return networkInfo != null && networkInfo.isConnected();\n }\n }```<hr>fif.iva:<br>Thanks a lot for this information @Janekxyz! Will check it out! :100:<br>@wiktorl4z - thanks for the code snippet! It looks useful, I think I remember seeing similar approach somewhere too, but didn't know when to use it! :ok_hand:<hr>Berenice:<br>I see my code is almoast the same as Janek’s one.<hr>nuhkoca:<br>@fif.iva good question! You should use BroadcastReceiver for dynamic internet connection check ```public class InternetSnifferService extends BroadcastReceiver {\n \n public static ConnectivityReceiverListener connectivityReceiverListener;\n \n @SuppressLint('UnsafeProtectedBroadcastReceiver')\n @Override\n public void onReceive(Context context, Intent intent) {\n boolean isConnected = intent.getBooleanExtra(ConnectivityManager.EXTRA_NO_CONNECTIVITY, false);\n \n if (isConnected) {\n Toast.makeText(context, context.getString(R.string.urgent_internet_warning), Toast.LENGTH_SHORT).show();\n }\n \n if (connectivityReceiverListener != null) {\n connectivityReceiverListener.onNetworkConnectionChanged(isConnected);\n }\n }\n \n public interface ConnectivityReceiverListener {\n void onNetworkConnectionChanged(boolean isConnected);\n }\n }```<hr>fif.iva:<br>Thanks @Berenice - I think I've been using this code in the projects that didn't work with Retrofit and for some reason I stopped using it after I start using retrofit. I suppose it's a better practice to have it anyway! <hr>fif.iva:<br>Great, thanks a lot @nuhkoca for the example, I'll make sure to save it and implement it in my code! :100: :blush:<hr>fif.iva:<br>Thank you everyone! Very helpful to know all of this! :raised_hands:<hr>nuhkoca:<br>However you should add that action in Manifest and also set the callback in your activity where you check connectivity<hr>fif.iva:<br>Gotcha, because it's a Broadcast Receiver!",
            "track": "and"
        },
        {
            "q": "Berenice: <br>Concerning the P5 (material app), did you show the long text (of a single book/ article) as is in a single textView or did you divide it in a kind of chapters and put it in an accordion like View?",
            "a": "Janekxyz:<br>@Berenice I put it inside only 1 textView <hr>nuhkoca:<br>You can cut off the long text with substring this is what I did",
            "track": "and"
        },
        {
            "q": "Berenice:<br>Hi, I am from the AND track, but have a question related to WebGL. Could someone help, please, this would be great. :slightly_smiling_face:<br>In Unity3D, I built a WebGL build, i.e. Unity exported an -.html file as well as -.asm and all other related files. I uploaded all files to a server, but the content is not shown, when I load the page from the server.<br>I think I have to make the -.unityweb file accessible. Would I have to do this in an -.htaccess file? And how would I have to this?",
            "a": "Michael Stadler:<br>Bad timing :smile: erm honestly I have no expertise on WebGL but somebody else may have?<hr>Berenice:<br>But, Could you help me on the -.htaccess matter? I think I have to allow access to that exotic file type, so that -.unityweb file types are accessible from the server<hr>Michael Stadler:<br>What have you tried so far in regards to the .htcaccess file? Did you research this matter on stackoverflow?<hr>Michael Stadler:<br>Maybe this would help you https://docs.unity3d.com/Manual/webgl-building.html<hr>Berenice:<br>I tried: ```<FilesMatch '\\.(unityweb)$'>\n Order allow, deny\n Allow from all\n </FilesMatch>``` <br>But I really don’t know what the code should look like.<br>However, the above code does not work, as absolutely no content will be shown. even the landing page will not work. … (edited)<hr>Berenice:<br>Thanks, I have already followed this link, but the server setup is not explained. The Unity built stuff is working while testing on a local host, but not live on a server.<hr>rodude123:<br>You don't do that. You have to edit the html file to get the other files<hr>Berenice:<br>@rodude123 Hm, the -.html file is quite simple:```<!DOCTYPE html>\n<html lang='en-us'>\n <head>\n <meta charset='utf-8'>\n <meta http-equiv='Content-Type' content='text/html; charset=utf-8'>\n <title>Unity WebGL Player | New Unity Project</title>\n <script src='Build/UnityLoader.js'></script>\n <script>\n var gameInstance = UnityLoader.instantiate('gameContainer', 'Build/myslide-v1.json');\n </script>\n </head>\n <body>\n <div id='gameContainer' style='width: 960px; height: 600px; margin: auto'></div>\n </body>\n </html>``` <hr>rodude123:<br>it should work just fine<hr>Berenice:<br>I think the links should be setup correctly, because on a local host it is working as expected, but not on a live server.<hr>rodude123:<br>try to add / before links<hr>Berenice:<br>Hm, but the “Build” directory is on the same directory level as the -.html file.<hr>rodude123:<br>so `/Build/myslide-v1.json`<hr>Berenice:<br>Many thanks @rodude123 It is working now. I had to write ```<FilesMatch '\\.unityweb$'>\n Allow from all\n </FilesMatch>```<br>And I had to manipulate the file structure on the server, because I have to work on a new and weird server portal which destroys the file structure (the sub-folders) while uploading several files at the same time.",
            "track": "mws"
        },
        {
            "q": "General Tips:",
            "a": "Michael Stadler:<br>- Before you push your code to github, remove your Google API Key and paste it into the instructor notes, so your key will not be exposed.<br>- Always update your readme, whatever you include in your project describe it so anybody who wants to use your application knows what the has to install or do in order to get your code running. This is a good template https://gist.github.com/PurpleBooth/109311bb0361f32d87a2<br>- Don't be afraid to reset something. I've reset the css a couple times as I've run into problems.<br>- Take regular breaks, it doesn't matter if you leave your code for 1 or 2 days and just enjoy the communication on slack for a bit.<br>- If you have problems with gulp I'd suggest this tutorial, which I used back in the day: https://css-tricks.com/gulp-for-beginners/",
            "track": "mws"
        },
        {
            "q": "Thinh:<br>Hey Michael, I am currently stuck on stage 3 and wanted to ask you something regarding the audit performance. I am currently suffering a whole second on the point 'Serve images in next-gen formats' but all the images listed there are fetched from google maps api. How do i approach this issue?",
            "a": "Michael Stadler:<br>Hey, what is your current performance score?<hr>Thinh:<br>around 70<hr>Michael Stadler:<br>Okay, so did you already look into google maps static?<hr>Michael Stadler:<br>This would be the documentation for it: https://developers.google.com/maps/documentation/maps-static/intro<hr>Thinh: <br>The API usage is pretty straightforward, is there a solution for my specific issue?<hr>Michael Stadler: <br>What I've seen is that some people also replaced google maps with an image, and on click on the image they initiate the map.<hr>Thinh: <br>That is a really great idea, let me take a deeper look into it<hr>Thinh: <br>Thanks!<hr>Michael Stadler: <br>It also depends on your internet connection, back then I've let my mentor try my application and due to his better connection I was able to hit the requested scores! The reviewers are instructed to run the test multiple times and if you are within a specific range of value you will pass :wink:<hr>Thinh:<br>Thats great! I will try my luck",
            "track": "mws"
        }
    ]
},
{
    "datetime": "13-jun-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "Is there a chance to start AND, after the ABND graduation? Can we find some free slots?",
            "a": "Congrats on finishing your ND! I saw your post on Facebook! We'll offer a discount code at the end of the program, but if you want to start beforehand you are welcome to!",
            "track": "and"
        },
        {
            "q": "What happens if I stuck and can't done one or 2 project before 14/8 what is the alternative ways for this?",
            "a": "The deadline date is 15/8, but if you are having issues, my suggestion is that you really should do everything you can to find answers. Reach out to your community ! We are holding Study Jams and other chances to get help. The 15th of August is the deadline, so if you want to have access to the material afterwards to finish it, you would have to sign on as a paying customer.",
            "track": "n/a"
        },
        {
            "q": "For how long is the nanodegree available after graduation?",
            "a": "We actually don't have that info right now, but will share it as soon as we do!",
            "track": "n/a"
        },
        {
            "q": "I'm wondering if there will be another scholarship challenge from Google this year for AND",
            "a": "That would be great! We hope so, but we don't have details yet. It will depend on the development of the partnership with Google.",
            "track": "and"
        },
        {
            "q": "How can we visit Udacity office in Berlin and meet our great community managers?",
            "a": "Great question! You can visit us whenever you like! Just ping @ magda.udacity or myself and let us know when you want to come by.",
            "track": "n/a"
        },
        {
            "q": "Do you have the next study jam planned already?",
            "a": "I am looking at the numbers of what projects students need the most help on, and then I will announce it this Friday! Hope you can participate. If you want to participate as a student or a student leader, you are welcome! Here's the sign up for student leaders: https://goo.gl/forms/tu0GZ6ylfc9HXl8e2 ",
            "track": "n/a"
        },
        {
            "q": "I'm on ABND. I was wondering, what next? What nanodegree I should take? Sorry my writing is quite bad right now because I have injured one of my finger in left hand. Let's say that I want to be android developer cause I think android basic isn't enough to get a work really hard to make my point and question.",
            "a": "Sorry to hear your finger is injured! ABND is enough to get work, we have students who have reported in the job report summart L https://goo.gl/forms/AnkaNz2aUepZbdfQ2<br>That they have gotten roles!",
            "track": "and"
        },
        {
            "q": "Is planned and if so, when, the next set of students like us? What is the chance to get an advanced course in android if I successfully complete the basic course?",
            "a": "We don't have concrete details for the next scholarship, but keep your eyes out! If we do have it, you could certainly apply to get into the advanced android degree",
            "track": "n/a"
        },
        {
            "q": "I saw a digital marketing nanodegree, will that help me if i want to start as a freelancer web dev?",
            "a": "That is a really great question. I want to say YES! Because Udacity's ND's are awesome, but I would say do some research on the site to really get a feel. I do know some employees that have done it, and they really enjoy it",
            "track": "fend"
        },
        {
            "q": "Another question, does anyone would give me the names of slack coaches for FEND, I need help in technical questions. Thanks a lot!",
            "a": "Sure! Check out the google site page and that has all the details you need: https://sites.google.com/knowlabs.com/gdnd2017/project-support/how-to-use-coaches?authuser=0",
            "track": "fend"
        }
    ]
},
{
    "datetime": "30-may-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "About the meetup in Berlin is the date set or could it still be changed? I wanted to know if I could start looking for plane tickets.",
            "a": "Details to come, thanks for asking.",
            "track": "n/a"	
        },
        {
            "q": "Is there a problem if I ignored submitting a specific project like the fifth project until the end ? I mean after finish submitting all project I'll submit this project later",
            "a": "You can submit whatever you want in any order, the main thing is to submit the all 8 projects.",
            "track": "n/a"
        },
        {
            "q": "After graduation, for how long can we still have the access to the forum, course, video, and etc?",
            "a": "There is no specific time after which you will lose the access to the classroom, so you should not worry about it. and when the time comes, we will make sure to notify you about the change.",
            "track": "n/a"
        },
        {
            "q": "Can we expect a second Android Hackathon before the course finish?",
            "a": "We won't have another Hackathon like we did earlier in the program, but we will do study jams starting on June 9th until the end of the program. They will be bi-weekly, and I'll send out information today, actually!",
            "track": "and"
        },
        {
            "q": "I was wondering how much can we rely on the Forum mentors for project related support?",
            "a": "Both Android tracks do have mentors in the forums, do you feel they are not present enough?",
            "track": "and"
        },
        {
            "q": "Will you arrange any meeting in cairo soon?",
            "a": "Nothing specific planned, but you are always encourage to plan meetups around things like the study jams! That would be really great if students in Cairo could meet and work together in person",
            "track": "n/a"
        },
        {
            "q": "Maybe I missed info about classroom upgrade with Android Architecture Components are we going to have that upgrade or?",
            "a": "Let me check on this for you all. If Jose told you differently, I can investigate.",
            "track": "and"
        },
        {
            "q": "I was wondering if there is a way to get/pay for a real certificate by post once we graduated?",
            "a": "Udacity only provides the certificate in digital format.",
            "track": "n/a"
        },
        {
            "q": "Will we be able to become mentors / project reviewers after finishing the ND?",
            "a": "Yes, definitely! Some of our students already did that. You can apply here: https://www.udacity.com/start-mentoring",
            "track": "n/a"
        }
    ]
},
{
    "datetime": "16-may-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "If I book another Nanodegree and pay for it , Is there a slack channel for it like which we're talking now?",
            "a": "Yes! All ND's have slack groups that you can join, however, not all ND's have community managers in the capacity that you have here in the scholarship program.",
            "track": "n/a"
        },
        {
            "q": "We will be able to have access to v.8 like all other students or we are stuck on v.7? Thanks! FEND, that is!",
            "a": "The version that you started in is the the version that you'll finish with. There are small difference between the two and you'll graduate with very similar content.",
            "track": "fend"
        },
        {
            "q": "A few students, as soon as they graduated, posted their certificates on Slack and I noticed that there was nothing on the certificate mentioning that this was a Google scholarship. Thus, I was wondering if there is a way to prove in the future that we are part of this scholarship.",
            "a": "Since you're graduating from the Nanodegree you receive a certificate for the ND and not the scholarship. Just as how a university degree wouldn't specify that you were in a scholarship or not. That said, you can always update your LinkedIn to say that you were a scholarship recipient.",
            "track": "n/a"
        },
        {
            "q": "I would like to watch the FEND webinar, next week. Is there already a link to the session?",
            "a": "There's not a link yet, but you can register here and I'll send you the link via email!<br>*Register here:* https://goo.gl/forms/pn0hAJEJYEykbEYt2",
            "track": "fend"
        },
        {
            "q": "Is there a Logo or png badge that we can add to our CV to show that we passed the nano degree or is it just the certificate that you supply?",
            "a": "We supply just the certificate. You probably don't want to add images or badges to a CV since, personally speaking, some employers prefer a cleaner look to your resume.",
            "track": "n/a"
        },
        {
            "q": "If we graduate before Aug 15, will it still be possible to submit the extracurricular projects after graduation but before Aug 15, or once we graduate we are not allowed to submit the extracurricular projects any longer?",
            "a": "Good question. I'm actually not 100% certain on my end but have already forwarded this question and will get back to you once I have a definite answer.<br><b>Student</b>: Yes you can. I graduated a couple weeks ago from the core syllabus and got the certificate, and after that started the extracurricular, submitted their projects, and got the feedback",
            "track": "n/a"
        },
        {
            "q": "Is there any news about how long the content of the course will be available after august 15th specially the career portal and the extra-curricular",
            "a": "As far as we know August 15th is the last day of the course and course access for everyone. That said, there has been discussion about this so it's not set it stone about what happens after the 15th.",
            "track": "n/a"
        }
    ]
},
{
    "datetime": "02-may-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "Just a curiosity. How are we progressing? Are the statistics looking good?",
            "a": "the stats look good but could always look better",
            "track": "n/a"
        },
        {
            "q": "I wanna ask about if anyone will not finish any project before the project deadline not final nanodegree deadline , what happens ?",
            "a": "the final deadline is final and absolute – August 15. All the other deadlines before that, are “soft deadlines”. That means that they are not obligatory, but only suggested. If you’re lated for the project deadlines, it’s not too bad, just submit it when you’re done. However, it’s very much recommended to try to keep up with the deadlines, as they are there to help you to schedule your time right.",
            "track": "n/a"
        },
        {
            "q": "At August 15th will GoogleDevNDScholars slack  be closed?",
            "a": "Slack will be closed a bit later than August 15h, so don’t worry, we will give you enough time to move somewhere else :wink: for example to facebook group that will always stay open https://www.facebook.com/groups/googledev2017. nice avatar btw",
            "track": "n/a"
        },
        {
            "q": "What happens if we don't manage to submit all projects before tha final deadline?",
            "a": "If you don’t submit all your projects before August 15, unfortunately you can’t graduate with the scholarship. You can continue as a “normal” paying Nanodegree student, until you finish everything. But if you don’t want to pay, I recommend you to try to get everything done before August 15!",
            "track": "n/a"
        },
        {
            "q": "I've passed the deadline for a project, should I skip it for now in tention to keep up with the next project deadline and then go back to it? Or should I first finish it and then keep with the process?",
            "a": "The deadlines are suggested by us and are there to help you pace your learning. If you did not manage to meet one, that’s totally fine. Just focus on getting the project done, on your own pace, and then go on with the next project.",
            "track": "n/a"
        },
        {
            "q": "This week I didn't pair with the group of study-buddies and one of my fellow students had the same problem...so I was wondering why that happened and if I did something wrong ?",
            "a": "Thanks so much for flagging! We will look into it ASAP.",
            "track": "n/a"
        },
        {
            "q": "The last project of ABND track has a deadline of 8th of July. Does anything happen after that - like some extra project? Or what else should we do between 08.07 and 15.08?",
            "a": "Good catch! Actually, these deadlines are calculated by the amount of time that is usually needed to do specific project and for some tracks (ABND and MWS) these deadlines are even earlier than August 15th. We won’t be adding any new projects to the classroom, but for these of you who finish in July, it will be a great opportunity to help others who might still struggle!",
            "track": "and"
        },
        {
            "q": "I found bugs in the quizzes, where I can report it?",
            "a": "You can report bugs, or give your feedback to content development teams, directly in your classroom. You need to click on “Report an Issue” link located under Resources tab in any of the lessons. Here’s the screenshot",
            "track": "n/a"
        },
        {
            "q": "If we graduate early, I guess we'll lose access to mentor support, right?",
            "a": "You might not lose it immediately, but eventually you will….you can always exchange the linkedin contacts with your mentor though!",
            "track": "n/a"
        },
        {
            "q": "Did a lot of people found a job after this nanodegree ?",
            "a": "We cannot share the official stats on that I’m afraid, but I can tell you that quite many. The important thing to remember is that we don’t find you jobs – we help you prepare for job search and support you on the way. So as long as you are motivated, and do your homework when it comes to job search, you should not be worry about finding a job after graduating. Especially given that we already have few students who got jobs even before graduation!",
            "track": "n/a"
        },
        {
            "q": "Any idea how long the mentorship application takes to get approved?",
            "a": "There is no precise answer to that, it really depends on supply and demand. If we’re quite good with the amount of mentors we have, the hiring of new ones is quite slow. All the applications get into a pool of candidates, from which they reach out to the ones that are most needed right now. Unfortunately, it’s hard to estimate when it will happen, so I’d suggest not to hold your breath too much.",
            "track": "n/a"
        },
        {
            "q": "When will be fixed the career portal? I still can't find my country Romania there",
            "a": "Udacity is an US company, and there are some legal limitations to our operation in certain countries, with which the US has some diplomatic issues. Unfortunately currently Romania is on that list, which limits our services there. We hope it fixes soon, but as for now, the legal restrictions are still in place. Sorry. ",
            "track": "n/a"
        }
    ]
},
{
    "datetime": "04-apr-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "Any news on the Google I/O tickets?",
            "a": "Friday.",
            "track": "n/a"
        },
        {
            "q": "Do you know if the career resources we have available through the Nanodegree are exclusively to help us get hired by some company, or we can get help also if we want to be self employed? In the sense of building our own app for profits, build up on our own idea and develop a company?<br>If not, do you know any good resources for what I'm talking about?<br>Thanks",
            "a": "@Pedro Monteiro Good question. I do know the career services are there primarily to help students find jobs with employers, but am unsure about how much they help with starting something up on your own. Certainly something I'm not curious about myself to find out.",
            "track": "n/a"
        },
        {
            "q": "Hi, I have a question regarding the Google I/O tickets. Did Udacity select the winners yesterday, or will you select them on Friday? It's a bit confusing for me because it's not clear that the selection process has already happened, or will happen on Friday. Thanks in advance for your answer",
            "a": "@Anna The winners have been selected but will be announced on Friday once all the behind-the-scenes technicalities are worked out. We need to contact them first and work out the details.",
            "track": "n/a"
        },
        {
            "q": "... since the issue my new mentor didn't answer my questions since 23th march. Is still more troubles about mentors system?  Or is the system fine?<br>Can I get my old mentor back",
            "a": "Hi @Maricel and @haja good questions, I will answer them both together:<br>Here are some details on how to rate your mentor and try to get a reassignment: When a student has been assigned to their mentor for more than seven days, they are asked to provide a rating for their mentor each week. Ratings are incredibly valuable for us and help us ensure that all students are receiving the highest quality of support in their Udacity Classroom. A student’s rating window is open from Thursday through Monday. After a student provides a rating, they’ll be able to continue corresponding with their mentor.<br>If a student would like to be reassigned to a new mentor,  they’re able to do so when they provide a weekly rating for their mentor. If a student rates their mentor 3 stars or less, they will be prompted to select an area of improvement, and then prompted again to elect to be reassigned to a new mentor.<br>As a note, a new mentor cannot see any information that a student provided to their previous mentor. Please be sure to update a new mentor any questions or concerns so they can help you get on the right track as quickly as possible.",
            "track": "n/a"
        },
        {
            "q": "my mentor has been changed at 25 mar , i filled the form. Is the new one will continue or this can be solved ?",
            "a": "@abdoutelb The issue took place and effected several students around the 23rd of March- approximately the 27th of March. The issue is now fixed and all mentors have been reassigned.",
            "track": "n/a"
        },
        {
            "q": "Will there be a FEND Hackaton?",
            "a": "@Lora thanks for the question. We are not able to do a Hackathon for FEND, but we are going to have a Webinar with a content developer and we are also planning some other ways that we can give FEND some project and technical support.<br>If you have any suggestions, please send them to the CM's!",
            "track": "fend"
        },
        {
            "q": "Hi, I published my first project in MWS but it reviewed and still there is work around on it to be accepted , is it consider delivered before due date or when be accepted only consider before due date ?",
            "a": "@Ibrahim Projects are only counted once they've been approved and accepted.",
            "track": "mws"
        },
        {
            "q": "Any news on the Udacity swag raffle from the webinars? :wink: _also, how was your easter holidays",
            "a": "@Asher We're on it. And it was good. Nice to have a few days to reset and enjoy some good food",
            "track": "n/a"
        },
        {
            "q": "Are we going to do a reversed AMA session where you ask us all the questions again? I'd love that",
            "a": "@nicolas Oh we loved those too. We'll definitely have them again hopefully sooner rather than later",
            "track": "n/a"
        },
        {
            "q": "Did Udacity select the winners yesterday, or will you select them on Friday? It's a bit confusing for me because it's not clear that the selection process has already happened, or will happen on Friday.",
            "a": "The winners have been selected but will be announced on Friday once all the behind-the-scenes technicalities are worked out. We need to contact them first and work out the details.",
            "track": "n/a"
        },
        {
            "q": "Do the I/O winners already know (going from answers above?)",
            "a": "They should. We contact the winners first to work out the details and if for some reason one can't attend the event, we move to a runner-up. It takes a couple days to finalize everything.",
            "track": "n/a"
        }
    ]
},
{
    "datetime": "29-mar-2018: Special ama with Leo Generali",
    "description": "This is a special AMA session with Front End Nanodegree alumn, Leo Generali",
    "attach": "leogenerali.jpg",
    "type": "special",
    "questions": [
        {
            "q": "What does a typical day look like in your job?",
            "a": "@alex-udacity Good first question! I’ll get into work around 9 or 10 and start my day off by checking my to-do list. We use personal trello boards here at WeddingWire, which makes keeping track of what you’re working on and how far along in the process you are super easy to look up. The advantage with this is that it really cuts down on meetings - there have been days where I get in and code for the entire day!",
            "track": "n/a"
        },
        {
            "q": "1) What would you tell someone looking to pursue a web development job full-time to focus on skill-wise if you had to boil it down to 1-2 things?<br>2) Can we see a sample of some of your favorite work? (That you’ve made of course!)",
            "a": "@Josh_B 1) Learning to learn. There’s no better skill to have than the ability to learn new things. Technologies will change and you’ll use different tools. If you have a good system set up for yourself on bringing you up to speed quickly on a new topic, you’ll be set no matter what challenge you may face. As an example, the job I’m currently at heavily uses Ruby and Ruby on Rails - I had bring myself up to speed quickly on the language to be able to contribute! <br>2) I’ve really enjoyed the projects I made with Udacity! They do a good job encompassing all of the different problems you’ll come across as FE developer. I don’t know that I have a specific favorite project cause that switches all the time, but you are free to peruse my github account and see what I’ve been working on in my spare time: https://github.com/leo-generali",
            "track": "n/a"
        },
        {
            "q": "What are some of your favorite external resources/tools you would like to share with us?",
            "a": "@daniel Honesty - the best tool so far has been plugging away on my own projects. I personally learn best by doing - following tutorials is tough for me. Getting into a work mode and developing things that I’m passionate about has been instrumental to my growth. A great set of resources I’ve heard about are the Wes Bos courses. His JS course is a great compliment to what the FEND program covers - and it’s free! https://javascript30.com/",
            "track": "n/a"
        },
        {
            "q": "How could i know that i have reached a good state and i am able to start a job, and is nanodegree projects enough for that?",
            "a": "@Hesham Start applying to jobs asap! Once you get into interviews you’ll quickly figure out what you need to work on. It’s hard to point to any specific skills you must have because all jobs have different needs and requirements",
            "track": "n/a"
        },
        {
            "q": "Hi Leo, there are so many frameworks available for FE Web Developers, far to many to try out. Which would you suggest learning (if any)?",
            "a": "@Colin I’m a big fan of React! That being said, there’s some people who really don’t like it. I think the best thing for you to do is build a simple note taking application with the big three (Vue, React, Angular) and see what you prefer. Whichever one you enjoyed best, learn that one! You’d be doing yourself a disservice by working with a tool that you don’t enjoy!",
            "track": "n/a"
        },
        {
            "q": "I would like to ask, if you could remember, how many hours you were spending every week on your Nanodegree program.",
            "a": "@Antonis Good question! I probably spent 2 to 3 hours each day working through the FEND. I was also working full time as a consultant during that time, which meant I had to be diligent about getting home and getting started. Every so often I’d take a day off of working through it to stay fresh and motivated",
            "track": "n/a"
        },
        {
            "q": "I often get stuck and don’t really know where my problem is and why it’s not working, so I don’t really know what to Google. What would you recommend how to deal with these situations or how do you personally resolve them?",
            "a": "@daniel One of the best skills you can have as a developer is learning to debug your code and figure out why it’s not working. If you’re having trouble understanding why something doesn’t work, strip away all of the layers until you get the bare minimum working. Once that works, add back the next layer. If that doesn’t work anymore, congrats - You figured out what was wrong! Easy peasy! If it does, add back in the next layer and so on and so forth until you get the answer you’re looking for. Don’t be afraid of your brower’s devtools either!",
            "track": "n/a"
        },
        {
            "q": "so in how much time did u get the ND?",
            "a": "@bouhlalnadia About ~8 months because I was working on it part-time",
            "track": "n/a"
        },
        {
            "q": "hi @leo_generali, thanks for being here answering our questions! I wonder did you already have programming experience before you took the FEND program? What was your career background? And do you have any advice for people who want to change their career from something else to Front-end development?",
            "a": "@Daphne 1) I had done some computer science back in high school and loved it but for some reason did not pursue it in college. At my last job I picked up a project formatting an email newsletter properly for a client which resparked my interested in development. <br>2) Before WeddingWire I worked as a Federal Healthcare Consultant for IBM. I graduated from college with a degree in Finance and a minor in Economics. <br>3) It’s totally doable! The good news is that so many people have done it before you and I that there is already a well defined path for success. The map is all laid out for you, which means that one of the biggest drivers of success if yourself. If it’s something you really want to do, you have to commit and make it a priority in your life. It becomes very easy to get home from work and just say 'Ohhhh, I can solve that tomorrow!' - trust me, I know from experience haha",
            "track": "n/a"
        },
        {
            "q": "Hi Leo, do you have any lectures you would recommend us to improve as a FEND ?",
            "a": "@Giulio If you want a more classroom type lecture - I’d look check out Harvard’s CS50 course! It’s tough - but REALLY good",
            "track": "n/a"
        }
    ]
},
{
    "datetime": "28-mar-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "This has probably been asked before so I am sorry if its a repeat but when we graduate do we still have access to the course material until the scholarship is over?",
            "a": "You will still have access to the course material, but we cannot really say now for how long.",
            "track": "n/a"
        },
        {
            "q": "After the mentor switch, the new one hasn't responded for over a week. Should I still wait for some time or ask for new mentor? (Previous one responded within a couple of days)",
            "a": "When a student has been assigned to their mentor for more than seven days, they are asked to provide a rating for their mentor each week. Ratings are incredibly valuable for us and help us ensure that all students are receiving the highest quality of support in their Udacity Classroom. A student’s rating window is open from Thursday through Monday. After a student provides a rating, they’ll be able to continue corresponding with their mentor.<br>If a student would like to be reassigned to a new mentor,  they’re able to do so when they provide a weekly rating for their mentor. If a student rates their mentor 3 stars or less, they will be prompted to select an area of improvement, and then prompted again to elect to be reassigned to a new mentor",
            "track": "n/a"
        },
        {
            "q": "How many students are eligible for Google I/O contest for now?",
            "a": "We will review that once the registration closes. The only thing I can say now is that we have currently over 1.5k submissions for the contest. And the number is still growing!",
            "track": "n/a"
        },
        {
            "q": "Two Suggestions: 1- Current Students who are experienced in the Course and help the student , and you can provide us with place to meet up . <br>2- you provide us with local mentors from udacity and a place to meet up",
            "a": "1. All Scholarship students can also participate in the regular ND Slack channels. The benefit of being part of the scholarship is that you have this community, but the regular ND's don't have the same offering, so this is something special for you all. In terms of meet-ups, we don't have any structure set in place, but we definitely want to encourage you all to self-organize.<br>2. Udacity is online and global so our focus is on having digital mentorship, so having in person mentors doesn't fit within our scope. However, with that said, you can always self organize and try to meet up with people you meet on Slack in real life.",
            "track": "n/a"
        },
        {
            "q": "About the hackathon, how is gonna happen? I mean I would be virtually present.",
            "a": "It's only for Android and you can do it either virtually or in person (if you are in the Berlin area). If you would like to sign up, use this form: https://goo.gl/forms/nPfgxdHh6lbrOnv52<br>Chose 1-2 projects that you would like to work on. We will then decide which projects are most popular and assign them to session coaches. During the weekend, they will walk through the project via a Live-stream and Slack and will answer your questions on the given project. At the end of the weekend, you should be able to submit that project for approval",
            "track": "n/a"
        },
        {
            "q": "A question regarding the extracurricular projects. Does the resume get reviewed by someone from my country or just a random reviewer?",
            "a": "Currently it’s a randomly assigned reviewer, however the knowledge and expertise they have to offer is rather universal, so don’t worry if s/he is not from our country!",
            "track": "n/a"
        },
        {
            "q": "If I have doubt about a plagiarism issue with some of my previous submitted projects, can I submit a new project again?",
            "a": "Once passed, the project cannot be submitted again. But I’d still recommend you to ask coaches, maybe they will have some tips for you based on their experience with the course.",
            "track": "n/a"
        }
    ]
},
{
    "datetime": "21-mar-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "How long does it usually take to get a review for projects?",
            "a": "@Daniel it varies between a few hours to a day or two. Depending on the reviewers’ timezone and workload. But usually the reviews are quite prompt.",
            "track": "n/a"
        },
        {
            "q": "Regarding the replacement of mentors, after you know what was the problem, will we get assigned to the previous mentors? or we will continue with the new mentors?",
            "a": "@Yousef Gamal honestly – we don’t know yet. We’re looking into what happened and what will be next. We’ll keep updating you when we have more clarity.",
            "track": "n/a"
        },
        {
            "q": "For *trip to* `Google I/O`.. Do we already have to have a passport before applying or we can start process of having a passport after -if- chosen for the trip?",
            "a": "@Akın Demir If you can get a passport/visa sorted before the the event happens then that would be ideal. Because Udacity is also arranging your flight, we would need your passport details to book your plane ticket.",
            "track": "n/a"
        },
        {
            "q": "About the Google I/O contest, which costs will be covered for the winners? I get the ticket will be fully covered. How about the flight for going/return?",
            "a": "@Gregorio Palamà the costs covered: flights (return) + accommodation + I/O tickets. Any other expenses (food, touristy things, visa [if you need one]) are on you.",
            "track": "n/a"
        },
        {
            "q": "Will you send any other e-mail including additional information about April Hackathon at  Udacity's Berlin office for Web Track in the following schedule?",
            "a": "@Engin Bozkurt We'll be making more announcements about these events soon. We appreciate your patience as we finalize the details on our end.",
            "track": "n/a"
        },
        {
            "q": "I'm sorry i don't know if this question asked before but is there any chance to get our Nanodegree certificate physically by shipping it and who want his certificate  physically he will  pay for shipping and so",
            "a": "@Deniz our Certificate is always digital (pdf). You can just print it out.",
            "track": "n/a"
        },
        {
            "q": "Is there going to be anything else after the deadline in August or is the whole program over when we graduate?",
            "a": "@Andrei Pintilie Once you've graduated from the program there is no longer any work to do or submit. That said, you become a member of our alumni network, are kept in the loop for any events we host, and the career services that will continue to be available to you depending on your track.",
            "track": "n/a"
        },
        {
            "q": "Hello, how can we access today's webinar? Is there going to be a reminder email with link?",
            "a": "@Pavol Briatka we’re a sending an email now, and we’ll also post the link here on slack.",
            "track": "n/a"
        },
        {
            "q": "From the last AMA session, I understand that as long as we're enrolled into this current scholarship, we're not eligible to apply for new Scholarships. I asked my mentor and he said that enrolling in other Nanodegree programs at the same time is possible. So, is it or it isn't possible for me to apply for Data Science if I am enrolled into ABND? If not, could't reconsider this for the ones who complete..let's say 90% or have 1 or 2 projects left to submit from the actual scholarship?",
            "a": "@Aida I apologise if you've received conflicting information on this issue. I've discussed this with our Program Manager as well as the VP of our Scholarship programs and the official stance is that students cannot be enrolled into the Data Sciene scholarship as long as they're still progressing through this Scholarship. If you finish all the projects you have now and graduate before, then you're eligible to apply for the next Scholarship.",
            "track": "n/a"
        },
        {
            "q": "Does Udacity has agreements or certifications that make it possible to accredit the ND as ECTS/credit points at universities?",
            "a": "@valeria.kori no, we don’t have such an agreement. We’re not Harvard yet, but we’re getting there.",
            "track": "n/a"
        },
        {
            "q": "Hi there,Is there a letter I can receive that shows that I'm enrolled in the nanodegree?",
            "a": "@Aviva Miriam Mandel I'm not entirely sure about this. The best course of action would be to contact the Nanodegree support e-mail for your track (and not the Scholarships support e-mail)",
            "track": "n/a"
        },
        {
            "q": "What is support email for AND nanodegree please?",
            "a": "@Aviva Miriam Mandel the support email for all our students is scholarships-support@udacity.com. And also you can always write me a message here or ask your Student Leader.<br>@Paul.Udacity: https://www.udacity.com/contact",
            "track": "and"
        },
        {
            "q": "Is there going to be anything else after the deadline in August or is the whole program over when we graduate?",
            "a": "@Andrei Pintilie yes, the scholarship programme is over. You’ll become a full-grown certified Developer – AND – become a member of the Udacity Alumni community. That means that you will have access to our Alumni career services, hiring events, potential support with our hiring partners and much much more. If you’re interested, you can also apply for becoming a Mentor or reviewer yourself! So after August 15, only the sky is the limit!",
            "track": "n/a"
        }
    ]
},
{
    "datetime": "15-mar-2018 Special ama with Allan Reyes",
    "description": "This is a special AMA session with 3 times alumn of Udacity, Allan Reyes",
    "attach": "allan-reyes.jpg",
    "type": "special",
    "questions": [
        {
            "q": "Are skills learnt by completing  Udacity FEND enough to get job as web developer ?",
            "a": "I think the best skill that FEND gives you is the ability to be self-sufficient in front-end... you 'learn how to learn' so to speak. That's an incredibly valuable skill. Even if there are FE skills that you are missing, you'll know where to look, how to think about it, and how to learn it.",
            "track": "fend"
        },
        {
            "q": "Were there times where you thought you wouldn't manage to finish a nanodegree?",
            "a": "Hmm... yes, definitely. I'm recalling my experience with MLND. I took 1 year to finish the capstone project... almost bailed, but decided it was worth it to finish.",
            "track": "n/a"
        },
        {
            "q": "Have job interviewers ever explicitly asked (more info) about your Nanodegrees?",
            "a": "So, I can't answer this, since after finishing the Nanodegree programs, I only ever interviewed at Udacity... I can say this though: I would recommend you not even give the _option_ for an interviewer to ask about for more info about your Nanodegrees—show off your work!!! One of the fantastic things about FEND is that you finish with a portfolio. Granted, some of them (early ones) tend to be very similar, but the later ones are more personalized and you can really use them to show off your skills.",
            "track": "n/a"
        },
        {
            "q": "Do you think that the projects done in the nanodegree are enough for a portfolio when looking for a job? or would you advise us to do some side-projects?",
            "a": "I think the earlier, introductory ones are probably too similar or too basic. It's been a while since I finished FEND (almost 2 years now), but I think a lot of the later projects are able to be personalized and modified. Side projects definitely help as well. As an engineering manager, I was always most impressed when candidates showed quality open source contributions. It shows that they a) can code b) care and c) know how to communicate effectively.",
            "track": "fend"
        },
        {
            "q": "How much you think one should know about JavaScript to be entry level programmer ?",
            "a": "As an eng. mgr., I always looked for two things: a) the candidate's ability to solve a problem (e.g. LeetCode, HackerRank type problems) effectively with it and b) demonstration that they're self-sufficient... like I mentioned before, that they 'know how to learn.' There's a certain point where 'you just get it.' It's that 'AHA' moment, where you know how to fish and your growth trajectory/slope is high. Once you hit that point, I think you know enough about JS and programming to be entry-level.",
            "track": "n/a"   
        },
        {
            "q": "Did u  at any time experienced the imposter syndrome feeling?",
            "a": "EVERY. DAY. The more you learn, the more you learn about things you _don't_ know. I say: take a positive spin on it. Look at it as an opportunity and reason to learn more. But, you should take a step back every now and then and realize,'Wow, I can build some really awesome stuff!'",
            "track": "n/a"
        },
        {
            "q": "what skills you learnt in udacity as a student and employee that helped you build your company?",
            "a": "`*` (glob) - Most of the skills I have in tech are due to the Nanodegrees and my work at Udacity.",
            "track": "n/a"
        },
        {
            "q": "How difficult was it landing a job after graduation? (I think you mentioned working at Udacity for 2.5 years, was that straight after graduation?)",
            "a": "Well, I wish I could give a general answer to this, but I think for me it was a bit of a special case. I was really active in the Udacity community as a student, and definitely had an advantage getting into Udacity. I actually tried to start a (different) company for a few months after graduation... it didn't pan out, but I found myself so excited about e-learning that I applied to Udacity—and got in!",
            "track": "n/a"
        },
        {
            "q": "Which upcoming technologies/frameworks you think are worth learning alongside?",
            "a": "I think it's most important, especially when starting out, to not 'spread yourself too thin.' It's really, super important to just pick a tech stack and *go deep*. You'll learn a lot more and be able to _do_ a lot more. I think a good point to explore another tech stack is either: <br>a) when you feel like you've learned as much as you could about tech stack X or <br>b) you have a project or job that is better suited for tech stack Y",
            "track": "fend"
        },
        {
            "q": "Are you working in the United States for a US-based company or working (remotely) for an international company? How would you assess the possibilties to work remotely for a US-based company?",
            "a": "I used to work at Udacity (and currently live in California). I think now is this _best_ time to work remotely. However, there is usually some overhead on the company's side when employing people across borders... so it may be harder to work at a smaller company that's missing some of the legal/HR infrastructure to manage it. Check out: https://remoteok.io/ (also, if you're entrepreneurial, check out the author's blog about how it was built and how incredibly successful it is... something like $50k+ per month in revenue)",
            "track": "n/a"
        },
        {
            "q": "Obviously a FE developer can make websites. What other possibilities are there with the same skill set? (E.g. developing presentations or emails)",
            "a": "Ahh! Styling emails is one of those things that I really tried to avoid (it's _hard_). I think FE is a really good entrypoint or launchpad into other parts of the stack (going into back-end as well), but can also branch laterally into other disciplines like design. Some of the most effective FE engineers I know are hybrid, i.e. they can design beautiful interfaces and then actually code them up. In short: there are a _ton_ of possibilities!",
            "track": "fend"
        },
        {
             "q": "Did you have a day-off every week, or what was your schedule so you don't get bored?",
             "a": "Well... I'd say I probably write code most days. It's really up to you to find balance, but for me, I just never really got bored about it.",
             "track": "n/a"
        },
        {
            "q": "So from one of your answers you say that solving puzzles like codewar and hacker rank is important in building your javascript knowledge,so what if it is difficult solving these stuff?",
            "a": "I should caveat this. Being able to 'solve puzzles' is a proxy for understanding data structures and algorithms. It's an important interview skill, but also an important programming skill—DS and algos are the primitives of how we build software... things (data) and how to manipulate things (algos). That said, I don't claim that the interview process is perfect. Solving puzzles isn't a good proxy for showing the ability to build a website. Anyway, the best way to get better at it is practice and building stuff.",
            "track": "n/a"
        },
        {
            "q": "Would it be possible to mention, as an example, some open source projects that you consider as very important and it really maters when a student contributes to such projects?",
            "a": "I don't have any off the top of my head, but I think contribution to libraries—no matter how small—are still really good. I remember seeing a candidate that had some contributions to `rails/rails`, which was super impressive. There are a lot of OSS projects out there that have beginner-friendly tickets to take on.",
            "track": "n/a"
        }
    ]
},
{
    "datetime": "14-mar-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "Any news about the MWS career support?",
            "a": "We are still working on a bigger roll out. There will be a small update coming in the next few weeks, we will make an announcement when it happens!",
            "track": "mws"
        },
        {
            "q": "What do we need to graduate? If all done and we push the button graduate is there a chance that we will be rejected?",
            "a": "You need to pass all the projects, which means everything needs to be approved before the deadline. If you get stuck on a quiz, you can utilize the support services, but having all your projects reviewed and passed by reviewers is your main priority! Once all of your projects are submitted and *approved*, a button to graduate will appear in your classroom.<br>It's important to note that you do this in a timely manner, and you should really be sure that you take into account the August 15th deadline! All the scholarship students will graduate if all their projects are approved before August 15",
            "track": "n/a"
        },
        {
            "q": "Do you have any statistics about employment rate after getting a nanodegree (in my case FEND) and what sort of company hires the alumni? I understand that you might not have such statistics for each country, but a general idea.",
            "a": "We don’t have such official statistics available, however I’d recommend you asking this question during our Webinar with FEND graduates next Thursday. They will tell you how the life looks like after getting Nanodegree, how soon you might be able to find the job afterwards, what’s good to keep in mind, etc. If you haven’t registered for the Webinar yet, you can find the link and all the additional information in Updates on Google Site: https://sites.google.com/knowlabs.com/gdnd2017/updates?authuser=0",
            "track": "fend"
        },
        {
            "q": "Can you tell us more about the front end hackathon?", 
            "a": "I will send everyone out information this week, so *stay tuned* but here's the gist:<br>We are having two different hacking weekends, one for Android and one for Web. Both weekends have the same goal and the same set-up. The Hackathon is meant to help students get through their course projects in your specific track.<br>By the end of the Hackathon weekend, you’ll be ready to submit the project you were working on for approval. It’s a great way to learn, receive support and get one step closer to graduation!<br>Each project will be live streamed and lead by a Session Leader, which is a Nanodegree graduate that will guide you through a specific project, from start to finish.",
            "track": "fend"
        },
        {
            "q": "I was just wondering if there was different graded levels when you pass the nano degree, or whether it is just a Pass or Fail?",
            "a": "There are no different grade levels, it is pass or fail!",
            "track": "n/a"
        },
        {
            "q": "Will the Nanodegree graduates at the webinars be EMEA residents? (as some job related questions might only be relevant if they are)",
            "a": "They are indeed from the EMEA region. We have some folks from Portugal, the UK and Spain.",
            "track": "n/a"
        },
        {
            "q": "I would like to ask about the projects deadlines that are on the Google site, but inside the lessons, it mentions that the second project for FEND track is due in 7 days 22nd of March and Memory Game project is due in one month...",
            "a": "The deadlines in your classroom are the suggested deadlines for the “regular” Nanodegree students who don’t have an end date/deadline for finishing the course. You, as a Scholar, do have such deadline though (August 15th). But since we don’t want to make changes of the deadlines directly in the classroom (not to confuse the “regular” students), we published the suggested deadlines for you guys on the Google Site. So we recommend to always check there and just ignore the deadlines stated in the classroom. https://sites.google.com/knowlabs.com/gdnd2017/deadlines?authuser=0",
            "track": "fend"
        },
        {
            "q": "Why are there only american located jobs in the career center?",
            "a": "It's a really valid one. This is something that Udacity is aware of, and trying to change it. The company is Headquartered in the US, but we are actively trying to update jobs according to our different geographic regions. In the Berlin office, we have dedicated staff who are trying to help solve this problem. What you can do in the meantime is check out the webinars that are happening next week on the 21st and 22nd.",
            "track": "n/a"
        },
        {
            "q": "Mentor and project reviewers are only freelancers right? You aren't an actual employee and are paid by the amount of work instead of regular salary.",
            "a": "Yes, the reviewers are paid per each review. You can find more details here: https://www.udacity.com/start-mentoring ",
            "track": "n/a"
        },
        {
            "q": "If I submit my portfolio project on 20th of March, am I in trouble?",
            "a": "The deadlines are there to help pace you to complete the Nanodegree on time, you will not get in trouble for not doing them on time :slightly_smiling_face: . However, it's important to try to keep up with them as much as possible so that you can stay on track and graduate by the 15th of August!",
            "track": "n/a"
        },
        {
            "q": "How long period of time we will have access to ND materials after graduation?",
            "a": "That time period is not specified at the moment. The information that we have is that it will be available to you for some period of time–it's vague at this point, but we will update you when we have more information.",
            "track": "n/a"
        }
    ]
},
{
    "datetime": "07-mar-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "When would you says the best time to apply to become a mentor? Do you have to realistically complete a nanodegree before hand or could we apply now?",
            "a": "The best time to apply to become a mentor would be after you've officially graduated from the course. That said there may be some opportunities in the future for student leaders to help coach others even before graduation.",
            "track": "n/a"
        },
        {
            "q": "How many percent of students from phase 2 finished last Google Scholarship?",
            "a": "Last scholarship had quite a different format, so its outcomes are not applicable to this one.",
            "track": "n/a"
        },
        {
            "q": "A student who wasn't selected for the second phase, asked me if you plan to send some more acceptance emails.",
            "a": "At this point in time there are no additional plans to accept more students into Phase 2 as pretty much all positions are actively full.",
            "track": "n/a"
        },
        {
            "q": "Is there any event for woman's day here and at Udacity?",
            "a": "IWD is a big event for us here and we wholeheartedly support it. Your CMs have been sharing their pledges every day this week so far in the FB group (https://www.facebook.com/groups/169936680313679/) and we have more things to share tomorrow and Friday.",
            "track": "n/a"
        },
        {
            "q": "Still struggling with the Responsive design part, but happy to keep on coding. Question: is it really needed to submit the portfolio project by friday, for i need a bit more time for that.",
            "a": "Hope you get all the help you can. To your question, the suggested deadlines are not mandatory, but highly recommended. So if you need a few more days, take your time, but try not to turn it into a habit - you have 8 projects to complete in this course!",
            "track": "fend"
        },
        {
            "q": "If someone have a a personal medical issue during the scholarship but he/she is determined and trying to keep up with deadlines and the learning process but not in a quick pace like others. Would that affect their chances negatively in obtaining the nanodegree or?",
            "a": "As long as you're motivated and have the ability to spend the extra time to catch up, you can still successfully graduate. :smile: We've already seen a handful of students finish the ND already and it's been less than a month!",
            "track": "n/a"
        },
        {
            "q": "Is there a plan to manage technical sessions?",
            "a": "in your FEND-specific Slack you will find “office hours” - which are essentially technical AMA sessions. As to us, we are planning some cool technical things for you guys, stay tuned!",
            "track": "n/a"
        },
        {
            "q": "so we are able to send all the projects by the end of the scholarship time",
            "a": "I mean, technically, you can But it's a lot to count on that the reviewers will have the time to review and leave feedback on all of your projects, and you'll have the time to fix and take their notes into consideration before the final deadline. Sounds like a surefire way to ignite a panic attack",
            "track": "n/a"
        },
        {
            "q": "I am from the Android Basics track and I just found out, that the resume help etc. is only available to the advanced track. I would like to apply for it in the future. Will this scholarship be available next year too? And when will we be able to apply for the following nanodegree?",
            "a": "It's possible this Scholarship does happen again in the future, but there are no current plans or news from Google that it will. Their focus right now is on the success of the program and this will influence if it happens again and whether we increase/decrease the number of participants. We did have a scholarship last year for AND and ABND, with some ABND students coming back for this scholarship as AND student.<br>So, short answer: it could happen and, if it does, you can apply.",
            "track": "and"
        },
        {
            "q": "I was wondering, are there any time frames for the mentor to answer questions? sometimes it's not convenient to wait for an answer for day-day and a half, when you stuck with a project.",
            "a": "It can take the Mentor between a few hours to a few days to reply. All depending on their timezone and workload. Don’t forget that we have a limited number of mentors and thousands of new students they need to tend to, so please be a bit patient. They are doing their best to  help everyone.<br>If you are looking for immediate assistance, I would recommend reaching out to your classmates on the forum, here on Slack, and in the ND-specific work groups. Collaborating with your classmates can also help you to learn the material by working through it together.",
            "track": "n/a"
        },
        {
            "q": "Is someone or any company tracking the progress of the students in order to hire them?",
            "a": "No. To the contrary - we are highly protective about our students’ data, so we don’t share your progress with any external bodies. We prepare you to the job market and want to launch your career in the best way possible, but only after you graduate. During the course you’re still just our dear student.",
            "track": "n/a"
        },
        {
            "q": "I would like to know what are the responsibilities of 'new generation' of local representatives (Student Leaders, if I'm not mistaken) and are they still 'bound' to the location of residence. The original posts are now taken by Slack and by the info provided there it was hard to tell, if I'm too busy for that or not - don't want my overestimation to lead to letting someone else down.",
            "a": "Basically, the Student Leaders will be something very similar to the Student Representatives in Phase 1 - i.e. being responsible for their local channel, helping relay all the important information and announcements, translate things if needed, keep an eye if there are any Code of Conduct violations, and keep us updated about what happens in the channel.<br>In addition to that the Leads can be as active on the general channels as well, and help students to find information and to see if somebody has a problem. In the same time, if some students are being super helpful, creating something cool, or have an interesting story to tell - we want to know about it too! We will also rely on their feedback if some things need to be improved.<br>So you basically can do the same amazing job you already did before as a student rep, but not only in your local channel, but on the general channels as well.",
            "track": "n/a"
        },
        {
            "q": "What's your daily routine as a community manager?",
            "a": "Hmm… I can't say that there is a set routine that we follow every day. But it involves meetings, conference calls with HQ in the US, discussing new ways to engage with you guys and help motivate you all to complete the projects. Marat does a lot of Slack activity, Joanna does a lot of behind-the-scenes panning, Magda is all about the Google Site and newsletters and analytics and I'm taking the lead on the FB group and future social media channels  and helping out with other internal stuff . We all also have shared tasks so our days are pretty full and it goes by so quickly. It still feels like Jan 1st was last week.",
            "track": "n/a"
        }
    ]
},
    {
    "datetime": "01-mar-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "Hi there, is it a known bug that some students lost access to the nanodegree? The course doesn't show up in the classroom",
            "a": "@Luis Lopes Yes, this is a known issue and we are working on it. :muscle: However what might help is to set up in your Setting the your language preference to English",
            "track": "n/a"
        },
        {
            "q": "regarding the ' Student Leader role ' which question should we answer in slack ?",
            "a": "@Enzo (AND) shortly - any questions you are able to answer :<br>In general, we’d like the Student Leaders be a proactive members of the community, engage the students in their channels, see if anyone needs help, relay information, and let us know if anyone needs our help. So it’s basically like the student reps from Phase 1, with some larger admin responsibilities throughout all the Slack community.",
            "track": "n/a"
        },
        {
            "q": "Can you tell us when will the next scholarship be available, if there is any?",
            "a": "@KaRouLi You can find information about other scholarships here https://www.udacity.com/scholarships. There’s is also a Data Science Scholarship Program powered by Bertelsmann starting soon https://www.udacity.com/bertelsmann-data-scholarships.",
            "track": "n/a"
        },
        {
            "q": "The students who finish the nanodegree could have free or discount tickets for GDD 2018? And do you know where is going to be this year?",
            "a": "@Maricel we are separate organisations, so we don’t have any such scheme yet or any info about it. But we might do something with them in the future, so we’ll keep you posted.",
            "track": "n/a"
        },
        {
            "q": "Hello, What is 'Weekly check in'. My mentor asked about it a week ago. I filled out the Technical Issues Survey but no response. What should I write to a mentor who seems to be very interested in it? His words: 'regarding the weekly check in , can you please check with Udacity support team, ideally you should be able to get a pop up in your classroom dashboard.' Thank you.",
            "a": "@Slawek 'weekly check in' is a feature we previously had on our NDs, but we don’t anymore. This is now replaced by the chatbox with the mentor. Meaning, that you can always contact your mentor, not just once a week.",
            "track": "n/a"
        },
        {
            "q": "Is there a way to get the subtitles checked and corrected? I keep seeing mistakes (ex: think/things..). I am not an English native speaker and sometimes it is a bit confusing..",
            "a": "@Matthieu the best way to address any issues or bugs within the Classroom is by going to the “Report an Issue” option in the Resources section on the left-had bar. The tech team will be able to spot the issue directly.",
            "track": "n/a"
        },
        {
            "q": "will i be able to access to the course for the course length if i finish the course earlier?",
            "a": "@Jonathan hey there! As a Nanodegree program graduate, you will retain access to your programs materials for a substantial period of time after graduation and you may download certain materials for your own records if you wish!",
            "track": "n/a"
        },
        {
            "q": "Hello @Marat.Udacity. A prompt appeared in the mentorship chat box, if I want to change my mentor and so on. After I filled all the information, the mentorship button dissapeared and hasn't appeared since. Should I wait some more?",
            "a": "@Victorholo it can be that your Mentorship service is suspended until a new Mentor is found who can take you on. As you can imagine we have a limited pool of Mentors, and 6000 new students, so it might take some days to find you a new mentor to pair you with. If this continues by Monday, please let me know!",
            "track": "n/a"
        }
    ]
},
    {
    "datetime": "27-feb-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "What does 'Udacity' mean?",
            "a": "@Yahia According to our founder, the origin of the name Udacity comes from our desire to be 'audacious for you, the student'",
            "track": "n/a"
        },
        {
            "q": "Is it possible to visit Udacity and meet the team at Berlin?",
            "a": "@Tho Vo Heck yeah it is! If you're going to be in Berlin, then shoot Marat a message and he can coordinate with you.",
            "track": "n/a"
        },
        {
            "q": " I knew that even if we finish the full course and projects earlier that we won't get the certificate till 15th. August but in the email I got earlier it was saying we'll get the certificate once finished. Can you please clarify it?",
            "a": "@XIII, you can indeed get your certificate early if you finish and submit everything. We have already had one rockstar student finish his entire course, so anything is possible.<br>Once all your projects are submitted and approved, a button to graduate will appear in your classroom. Once you click on it, it will take around 1 week to check everything and receive the certificate. It will be sent to you via email in a PDF form.",
            "track": "n/a"
        },
        {
            "q": "https://www.udacity.com/bertelsmann-data-scholarships , can't we apply in our case ? thanks Enzo",
            "a": "@Enzo (AND) I've answered this one before, but just for extra visibility I'll address it again.<br>As long as you're enrolled into this current scholarship, you're not eligible to apply for new Scholarships. That said, if you can finish and graduate from the course before the application window for new programs close, then you'll be eligible since you'll no longer be in a Scholarship.",
            "track":"n/a"
        },
        {
            "q": "Which is the role of a mentor?? is for career or only technical advice?? who can advise me with intermediate problems??",
            "a": "@Dijack The mentors are there for technical advice and support.",
            "track":"n/a"
        },
        {
            "q": "is there a forum for the nano-degree",
            "a": "@Ahmed Monem You can find and access the ND forum via the 'Forum' link under the resources tab in your classroom. *Note* there is no ND forum for the MWS track.",
            "track": "n/a",
            "attach": "uploads/forum-access.png"
        },
        {
            "q": "where can we get the cool udacity t-shirts you all wear in the videos, I would love to buy one!! ",
            "a": "@AbbieTurner95 Haha, we don't sell them. We are aware that there are students who would like some Udacity swag and so we're looking into the options available to us at the moment.",
            "track" : "n/a"
        },
        {
            "q": " How valuable is the nanodegree certification in the real world scenario? Do employers actually care? Hope I'm not sounding too pessimistic ",
            "a": "Hi @Zuzana, thanks for the question.  The skills that you have at the end of the program do really help you get jobs. If you have a career ready ND then you can have access to resources, like CV reviews as well tips on networking, etc. We have a lot of companies that are partners, so Udacity tries to help students get into jobs in these companies. You can also become an active alumni and get connected to other resources that Udacity facilitates. And if you want to hear real stories of students that have gotten jobs after doing an ND, take a search around our blog or around our Medium and you can read some great, inspiring stuff:<br>https://blog.udacity.com/<br>https://medium.com/udacity",
            "track": "n/a" 
        },
        {
            "q": "Hey, are we allowed to up the Java language level to 1.8? If so, if a method say *Stream.of()* or *String.join()* needs a higher API level do we have to write code for both API 24+ and 24- or will it be accepted with only the one solution (that one being the one that requires API 24+)?",
            "a": "@Schadenfreude Android supports up to Java 8 so you can use it. Java 9 is not fully supported, so you should not use it. The methods that you mentioned are part of Java 8 so that is OK.<br>Please note that those are pure Java methods so they are not related with the API level that you are using.<br>Methods in the Android SDK can depend on the API level. If that's the case sometimes you need to write a different code depending on the API level and sometimes there is some kind of solution from the compat libraries. It depends on each case. What it is sure is that your app must work fine in all versions from the minSDK that you use so you will need to handle those cases accordingly.",
            "track": "and"
        },
        {
            "q": "Hi, I don't want to be unkind or rude but have you realised that the amazing community that was built during Phase 1 between students is getting down now because be active in Slack or Forum is not valuable anymore?",
            "a": "Hey @Ali [ABND], this sort of dip in activity is to be expected. When we initially made community participation a requirement to qualify, we knew some students would only be active so they can qualify. Kind of like how some people will put in 110% into a new job but once they've made it past their probation period they then put their foot on the brakes a bit. Could you imagine what this Slack channel would look like if it wasn't a requirement in the first place? Oooo wee!<br>That said, this phase of the Scholarship is where things get real and the work load really kicks in. Social interaction is great and it is encouraged, but with the time needed to fully graduate, we're happy that students are working on and submitting their projects.",
            "track": "and"
        },
        {
            "q": "I read that AND lose access to mentors after the first lesson or so? If thats right what sort of help will we get with ideas for the project that we have to think of ourselves?",
            "a": "Hey there @AbbieTurner95, thanks for the question, You can find an answer about services here:<br>https://sites.google.com/knowlabs.com/gdnd2017/faqs/services<br>As for what to do next, you can utilize the forum, the live_help channel and also use your ND specific slack group that has all students (scholarship and regular students) to help. There's still support and we hope it works out!",
            "track": "and"
        },
        {
            "q": " I don't usually ask much since everything has been straightforward but its crossed my mind (since I'm searching for them) - do you have any internship opportunities at the Berlin office?",
            "a": "Hey @Asher, I love your question! We don't have anything open at the moment, but yes, internships do exist. Keep your eye out on our jobs page and also follow us on LinkedIn! That is really the best way to get informed. If there are ever job postings that look interesting, don't be afraid to reach out if you have questions!",
            "track": "n/a"
        },
        {
            "q": "Can I apply for a job at Udacity after I finished my nanodegree",
            "a": "@Paul: @Tho Vo If we have an opening that you fit, then of course.<br>@Joanna: It's never to early to start thinking about jobs, and getting excited, motivated and confident in yourself!",
            "track": "n/a"
        },
        {
            "q": "Here in the capstone project rubric https://docs.google.com/document/d/1TQdqDerPd09pJzmsi95MPKbV9OwZSkPyonaPRvu8GpA/pub?embedded=true  There is said: 'Include only safe-for-work content in your app'  . What do you mean by 'safe-for-work' – does it mean we have to use material (graphics, pictures etc.) which is 'free to use' in regards to any licenses or I do have acquired the licenses respectively",
            "a": "@Berenice Safe for work refers to images and content that aren't obscene, offensive or intended for mature audiences. Not Safe for Work (NSFW) images include gore, nudity, sensitive images, etc.",
            "track": "n/a"
        },
        {
            "q": "@Paul.Udacity, let us seize the opportunity and congratulate @Diana Vilé, @Bycor, @Patrícia, @LaurenM, @ tom @Monica Moura and @nicolas who created something valuable to all of us although they are already in phase 2 and had no tangible incentive in doing it. <br>An excellent example to every student! https://sites.google.com/view/createdbyudacitystudents/home/fend",
            "a": "@Antonis Well said! There are so many students who put in a ton of extra effort that no one even asked them to do. The name you mentioned, and more, deserve all of the kudos we can give.",
            "track": "fend"
        },
        {
            "q": "anyone know where the link is to apply to become a mentor etc",
            "a": "https://www.udacity.com/start-mentoring",
            "track": "n/a"
        },
        {
            "q": "I am a little curious about the culture at Udacity, my question is for @jose, do you happy coding there ?",
            "a": "@Tho Vo I haven't had a chance to visit other office, but the people in the Berlin office are some of the most motivated and hard-working individuals I've ever met. They wholeheartedly believe in the idea of 'students first'.",
            "track": "n/a"
        },
        {
            "q": "Is there an office in the UK? @jose",
            "a": "The only Udacity office in Europe is in Berlin. There used to be one in London some time ago.<br>I am the only employee in UK",
            "track": "n/a"
        },
        {
            "q": "its my second mentor that is inactive HE do literally nothing no talking no answering questions .... for me now mentoring in this course is nonsense cant you fix it ?",
            "a": "I'm sorry to hear you're not satisfied with the communication, or lack of, that you're receiving from your mentor. Mentors normally have many students under their umbrella that they help and responses could take 24-48 hours. If it has been longer than that, then please write to mentorship-support@udacity.com so they can look into your case.",
            "track": "n/a"
        },
        {
            "q": "I am in (ABND)Can i ask the mentor on topics beyond second project  .as long as i haven't submitted my second project..or is it only for the first 2 projects?",
            "a": "@TarekB You can always ask your mentor, however, they are meant to help with just the first two projects. You have some other cool resources to use beyond the mentor's support, so please don't feel like you're left high and dry!",
            "track": "and"
        }
    ]
},
    {
    "datetime": "23-feb-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "I quote: 'I understand that I may be asked to explain my work in a video call with Udacity Representative before my Nanodegree is conferred.' How it will happen? What service will you use for video call? What if I unsure about my spoken language skill?<br> 2) 'For verification purposes, the name on your Udacity account must match the government-issued ID you show us during this interview.' - do you mean local passport? You could read it in even if document not in English?",
            "a": "We don’t have this service anymore. We update our products very often and some parts of the NDs are not adjusted yet. This is now replaced by the personal Mentor chat box in your Classroom.",
            "track":"n/a"
        },
        {
            "q": "Since I sent the application for admission for Data Science, should I cancel it for not being sanctioned? Or are there no sanctions and will not they accept me? ",
            "a": "Thanks for the question. If you finish your ND with this scholarship before the Data Science scholarship begins, then you are free to join. However, you are not allowed to be enrolled in both at the same time.",
            "track":"n/a"
        },
        {
            "q": "Are we allowed to use our preferred build tools for our deliverable projects? I.e. webpack, typescript, or whatever. I'm on the MWS track.",
            "a": "Not sure about this as I am not aware of this technical details. You should ask to your classroom mentor or in the forums. Think that if the reviewer cannot build your project then it will be mark as ungradable.",
            "track":"mws"
        },
        {
            "q": "FEND what happens if a student did not submit or complete the course by 18 Aug?",
            "a": "To begin with the deadline is *August 15*! And if not all your projects are accepted by this date, unfortunately it means that you will not pass the course and will not get a certificate.",
            "track":"fend"
        },
        {
            "q": "I'd like To know How Udacity thinking keep touch with there graduated student?",
            "a": "Udacity considers its Graduates a very valuable part of our community of Udacians. We work with hiring partners, who are leading enterprises in the industry to support as many of our Graduates into careers. <br>For this we have our Alumni Community for which we have additional career services, and we organise events, such as “Intersect” and “Accelerate”, that are coming very soon, for our Graduates to find their dream jobs.",
            "track":"n/a"
        },
        {
            "q": "If all project are accepted and core lesson are finish, can I get a certificate? If I finish this part early, can I still access to elective and career material?",
            "a": "Marat: You can get get a certificate as soon as all your projects are accepted. You will get a new button in your Classroom saying “Graduate now”. You can decide when you want to do it, so if you need more time to go over the extracurricular projects, you can wait with your graduation a bit longer.<br>Joanna: You can get the Udacity certificate as soon as you finish the coursework and submit all projects.   As a Nanodegree program graduate, you will retain access to your programs materials for a period of time after graduation, and you may download certain materials for your own records if you wish. Content access should include access to lessons, videos, quizzes, projects, discussions, etc.",
            "track":"n/a"
        },
        {
            "q": "I need to finish this scholarship before there will be made decision who is enrolled into another scholarship? Or before there will be finish date of sending candidatures to that scholarship? ",
            "a": "You cannot be enrolled in two scholarships at once. If you finish this ND program early then you can participate in another scholarship that would start before August 15th. The main point to remember is that you cannot be enrolled in two at once.",
            "track":"n/a"
        },
        {
            "q": "For project 2, website, if the basic requirements are reached, can we add some extras ourselves or do we need to replicate the mock-up 100%?",
            "a": "As long as the basic requirements are met, you can add as much extras as you want. The Reviewers may even congratulate you for your creativity and extra effort!",
            "track":"fend"
        },
        {
            "q": "I read somewhere that somebody sends to their mentor projects for a code review. is it necessary? also is it possible that someone else will make a code review on Github before we submit to Udacity?",
            "a": "If it helps you - sure, why not! As long as in the end the code is original and entirely yours, you can get it reviewed by others before the submission.",
            "track":"n/a"
        },
        {
            "q": "Can we recommend other commercial, online resources/courses in our slack channels if we think they are valuable compliments to this course? ",
            "a": "As long as they comply with our Code of Conduct: https://sites.google.com/knowlabs.com/gdnd2017/community/community-rules<br>It's always awesome help others and share resources that work.",
            "track":"n/a"
        },
        {
            "q": "ABND, I've submitted my first project and also got reviews. But how do I know if I have passed it? There's no result in the review.",
            "a": "Projects get only 2 possible results “Requires changes” and “Meets specifications”. If it’s still in review, you should just wait until you get the result.",
            "track":"and"
        },
        {
            "q": "The other day, Jose said it takes about a week to process everything from the time we press the big 'Graduate' button at the end of the Nanodegree. Does it mean we have to have our last project reviewed and accepted at least a week before Aug 15, or can we press that button on Aug 15 the latest?",
            "a": "In any case it’s always better not to leave the last project to the very last week - just to on the safe side. Same for the extracurricular projects, it’s better to be done with everything a bit earlier, but we won’t be as strict with these things as with the projects. ",
            "track":"n/a"
        },
        {
            "q": "If my last project was submitted but not reviewed till 15 aug , what can I do, and what will happen?",
            "a": "If your project is submitted by 15th August it will be reviewed and you will graduate if you pass even if the review takes some extra days. If you don't then you will need to resubmit again but as a paid student.",
            "track":"n/a"
        },
        {
            "q": "We received soft timelines for the Nanodegree Projects, but not for the Lessons. How can I assess if I am on track time-wise with the lessons? One underchapter a day?",
            "a": "The course is entirely self paced, and different people will take different times to go over all the lessons. So we wouldn’t like to stipulate deadlines for this too. But you are very welcome to figure out your own timeline! Time management rules! ",
            "track":"n/a"
        }
    ]
},
{
    "datetime": "22-feb-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "This morning I needed to tag you, rock-star Community Managers :star:,  in a channel. I did as usual, i.e. check who's online at that moment and tag that person. Is there a better way for us to do it? Should we tag the 4 of you? Or is there a bat call for the 4 of you like @here for us?",
            "a": "For this phase of the Scholarship @Marat.Udacity has taken on a larger role when it comes to Slack communication. That said, it doesn't hurt to tag us all to increase the chances of getting a response.",
            "track":"n/a"
        },
        {
            "q": "How many people actually applied for the first stage of the scholarship?",
            "a": "There were over 100 K applicants.",
            "track":"n/a"
        },
        {
            "q": "If we don't finish the nanodegree on time, can we still buy an extra month or so like a non-scholarship student to finish it?",
            "a": "You can, for sure, become a paying student. We will offer some level of a discount that you can use ",
            "track":"n/a"
        },
        {
            "q": "I've asked before but haven't found an answer. How useful is the Google MWS certificate?",
            "a": "I don't want you to think we're ignoring you. As Community Managers we have a general overview of the program. I believe a question like this could be answered much better by a mentor. ",
            "track":"mws"
        },
        {
            "q": "What is the procedure to change ones' mentor?",
            "a": "If, for some reason, your current mentor is not working out for you then you'll need to contact  mentorship-support@udacity.com. Each case is personally reviewed and the team there will follow-up on your request. That said, if your mentor is slow to respond to you, then perhaps give them a little more time. Remember, 6,000 new students just entered the mentorship bubble after all",
            "track":"n/a"
        },
        {
            "q": "Can we use some Framework like Angular for the project?",
            "a": "Jose: Honestly, I am not aware of the technical details of the Web tracks so I cannot really say. You may want to ask your classroom mentor or in the forums. We are planning to add some specific mentors here for the web tracks but we need to find the right people. Sorry not to be able to give you a better answer.",
            "track":"fend"
        },
        {
            "q": "Is there is a max number of project resubmission?",
            "a": "There is no limit per say, but when you submit your projects, you have to go through a process with your mentor to review it, update the feedback and then resubmit it. Also, the mentors get swamped during this time.<br>I think it's always best to try to submit the best work you can at that moment so that you don't have going through the submission process and waiting for a long time!",
            "track":"n/a"
        },
        {
            "q": "I want to ask question regarding scholarships in general? Why all nanodegrees scholarships overlap? ",
            "a": "A lot of the scholarships overlap because they aren't built to have folks double enrolled. If you have finished one scholarship before the deadline, students are welcome to apply for an overlapping scholarship. However, the idea is that students are enrolled in just one scholarship at a time in order to have maximum focus on the course material.",
            "track":"n/a"
        },
        {
            "q": "Is it possible for us to apply for the data science scholarship? Since we are going into technical details now, just the phase 1 of the DS program shows a significant overlap with phase 2 of the Scholarship, would it be a real problem? First phase is 'just a course' while second phase, the actual scholarship program, starts most likely on the day this here ends (8th of May + three month + one week selection=15th of august).",
            "a": "I actually followed up on some more technical questions regarding this in a meeting last evening so I'm prepared for this one.<br>As I mentioned yesterday, students can not be enrolled in more than one Scholarship at the same time. Because the Google Developer Scholarship and the Data Scientist Scholarship have overlapping dates, you wouldn't be eligible to apply for the DS program. Even if the first part of the DS scholarship is just a challenge course.<br>THAT SAID, if you're a coding ninja and you graduate from the current Scholarship before the next scholarship begins, you're more than welcome to apply for it.",
            "track":"n/a"
        },
        {
            "q": "If we use the career portal and create a portfolio there, how long will this page  be accessible and published? Will the portfolio be closed after course completion or will we be able to access and update it afterwards? ",
            "a": "Jose: I can see my profile being still there and accessible with an option to turn it on and off. I guess that it means that it will be there as long as you want to keep it on.",
            "track":"n/a"
        },
        {
            "q": "How long does it really take to receive the project feedback? Project submission page says 'You can expect to receive your project feedback from a Udacity reviewer in 24 hours'. It's already 3rd day and still no response.",
            "a": "Normally, we would say to wait 24-48 hours for a response. Since this is still early on in the program and 6K students have just been added to the mentorship pool, initial responses may take an extra day or two to happen. I'd say that if you receive no response by Monday morning, then contact mentorship-support@udacity.com",
            "track":"n/a"
        },
        {
            "q": "What happens after Phase 2? Is it the last one? ",
            "a": "The beginning of the rest of your LIFE!<br>There are a few things you can take advantage of: First, you will be an official alumni if you finish the program. This means you can take advantage of some of the Career Services that are offered to graduates– some services include events, webinars, etc. Second, you will have a bunch of new skills and knowledge that you can leverage. I would recommend taking advantage of things like resume reviews and getting yourself set up on on LinkedIn, if you haven't already.",
            "track":"n/a"
        },
        {
            "q": "Is there any guideline to have a project published on spotlight section of Udacity Google scholar site? ",
            "a": "You can feel free to send your app and the details of what you created to one of your community managers in a DM!",
            "track":"n/a"
        },
        {
            "q": "Is there any other recommended place where we can get content/advice from Udacity Nanodegree graduates other than Udacity blog? https://blog.udacity.com/?s=graduate ",
            "a": "I am happy to hear you are already thinking about graduation :raised_hands:. Udacity tracks information internally, but a great place to look is by doing a search on Medium for reading about students' self-published articles. Also, you can check out the Udacity official Medium: https://medium.com/udacity",
            "track":"n/a"
        },
        {
            "q": "Are we allowed to first send our projects to our in-classroom mentor to have a look before submitting them for review?",
            "a": "Your mentor is there to help you prep for projects reviews. Depending on the scale of the project, sometime mentors may be able to do this and, in other situations, they may not be able to review the whole thing. That said, stay in contact with them consistently and your projects should be in good shape.",
            "track":"n/a"
        },
        {
            "q": "We have been told that Google certificate is something separate from udacity certificate, does ND alumni have advantages over other applicants to pass the exam and. Being awarded the certificate? Another thing to ask, project reviewers from Google or Udacity? ",
            "a": "The Google Certificate is completely separate from Udacity and the Scholarships program. You'll be on a level playing field as anyone else who goes for the certificate.",
            "track":"n/a"
        }
    ]
},
{
    "datetime": "21-feb-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "How do I know if I need to re-submit project?",
            "a": "Paul: The feedback you receive when you submit your project will either give you notes on what to change or they'll approve it. If it isn't approved and they send you notes, then you'll know you need to resubmit.<br>Joanna: Projects get 'Requires Changes' or 'Meets specifications' if you need to resubmit them. When 'Meets specifications'appears, it means complete and resubmitting is not possible.",
            "track":"n/a"
        },
        {
            "q": "Why are the deadlines extended until September 16th if the scholarship ends on August? Does this means we have one more month to submit projects? This seems to be causing a good bit of confusion.",
            "a": "We are updating the Google site to have the proper wording, but you can ignore the dates that extend after the program. You still need to finish the projects, but you will need to turn them in before the 15th of August. Those dates are for the regular Nanodegree students and therefore are not on any specific deadline.",
            "track":"fend"
        },
        {
            "q": "What can i do if the mentor didn't reply from 3 days?",
            "a": "As you can imagine, our Classroom Mentors just got thousands of new students they have to attend to, and the same amount of projects needed to be reviewed. They are doing their very best to reply to you all as fast as they can. In these first few weeks please be a bit patient and give them some time to respond. Some are very quick, and some might take as much as 48 hours to reply. Depending on their timezone and workload. Most of them actually have a day job in the industry – and that’s exactly what makes them into experts in their field and such a valuable resource for you to learn from!",
            "track":"n/a"
        },
        {
            "q": "What happens if a project doesn't pass? Can you submit it again after resolving the problems and improving it? Or are you out of the scholarship?",
            "a": "You'll receive feedback on your first submission with notes on how you can change/improve your project. This encourages you to work more on your submission and then send it in again. This is why we encourage everyone to complete and send their projects in well in advance of the due date to account for the time needed to make revisions based on feedback.",
            "track":"n/a"
        },
        {
            "q": "I don't see the icon of career path, what I can do? (i'm in mws track)",
            "a": "this is an issue that some MWS folks are experiencing. You can go ahead and fill in this form, and we will get to your issue!<br>https://docs.google.com/forms/d/e/1FAIpQLSfrcb-KiLQb4duST9v-lpTrKLYfKaH1uq0Hkn5LdAUm3OwwEQ/viewform",
            "track":"n/a"
        },
        {
            "q": "Before this scholarship, I was enrolled in the Android Developer Nanodegree. I have not finished it yet, I have to submit 'Make your app material' project, then 'Capstone project'. Now that I have been selected for the full 6-month Google Developer Nanodegree Scholarship, that means I do not have to pay for the Android Developer Nanodegree in the next 6 months. Am I right?",
            "a": "If I understand your question right, you've already paid for the ND but have also just been accepted to the Scholarship version of it?<br>Unfortunately, per the terms of the scholarship, your enrollment into your previous Nanodegree program cannot be refunded. However, if you would like to pause your Nanodegree enrollment that you've paid for then that it one option available to you and others in your situation.",
            "track":"and"
        },
        {
            "q": "I am enrolled in ABND and after I finish it I want to go further with Android Developer Nanodegree from August. If I want to also enroll to Data Science Scholarship Program on April, do you think I could manage both Android Basics ND (then Android Dev) and Data Science? Is the Data Science scholarship available every year?",
            "a": "You can apply for other scholarships while being in a scholarship, but you cannot be enrolled in more than one Scholarship at the same time. Since you're already in the GD Scholarship, you wouldn't be eligible for the Data Scientist Scholarship that starts in April/May.  As for if we'll do this every year, that entirely depends on our partners like Bertelsmann and Google and how well these current programs perform, so anything is possible.",
            "track":"and"
        },
        {
            "q": "I was given ND scholarship just yesterday by email, I don't know who my mentor is, what should I do? How do I contact?",
            "a": "This depends on your program. If you head over to the Google site under the FAQ's you'll get some information:<br>https://sites.google.com/knowlabs.com/gdnd2017/faq<br>You can see which services are offered to you for your specific ND. You will see you mentor pop up in a chat box once you log-into your classroom.",
            "track":"n/a"
        },
        {
            "q": "Are you going to give the scholarship students guideline dates for project completion too then?",
            "a": "Absolutely! You can head to the Google Site and check under the 'Deadlines' tab. All the details can be found there.",
            "track":"n/a"
        },
        {
            "q": "You were talking earlier that it is possible to change 1on1 mentors. Any updates on that?",
            "a": "Since the mentors have essentially received a sudden influx of 6,000 students, responses may take more than a couple days to happen. That said, if for some reason your mentor still hasn't contacted you or you're generally not pleased with the assistance you're receiving, then please write in to our mentor support line (mentorship-support@udacity.com) where we'll have to review these issues on a case-by-case basis.",
            "track":"n/a"
        },
        {
            "q": "I know it might be advisable but is it mandatory to go through all of the lessons & quizzes in a section before submitting a project?",
            "a": "No, it is actually not necessary",
            "track":"n/a"
        },
        {
            "q": "So if I finish this scholarship in march I'll be able to be enrolled into Data Science? And if not - I'll have to choose which ND I want or I'll be rejected?",
            "a": "Theoretically, if you've finished the course by March and are no longer in the Scholarship then you should be eligible to start another one in April/May but I'll need to confirm this first before I can say this correct.",
            "track":"n/a"
        },
        {
            "q": "Could you please provide a time table of deadlines tailored for FEND track  as the other one in the site is for the paid nanodegree not this scholarship track? ",
            "a": "If you go to the Google site and check the tab that says 'deadlines' you can find more information for the FEND deadlines",
            "track":"fend"
        },
        {
            "q": "As we are in different tracks, surely most of us are sticking to a specific channels! Are you open with idea to create an announcement channels for students? So we could announce important news and information ! Take into consideration other channels like random is not for that reason, thanks ",
            "a": "Thanks for the suggestion, that is a really great idea. We are actually enlisting a calendar into the Google site, and students will be able to add community events. This is a cool way that we can share your events out. More to come later.<br>But to answer you directly, if you have announcements, feel free to ping one of your community managers, and if it's pertinent for the group, we can post in announcements for you.",
            "track":"n/a"
        },
        {
            "q": "Your answer for enrolment in data science scholarship is a little bit confusing here! @Marat.Udacity have said 'engaging in scholarship will not increase the chance of getting new one and also will not decrease it' (the quote here is not literally )",
            "a": "Apologies for this confusion, this was the messaging we went with during Phase 1 of the Scholarship simply because anyone who was not selected to be in phase 2 would be free to try their hand at our future Scholarships and there would be no overlap. Because you are all in Phase 2 now, this overlap exists.",
            "track":"n/a"
        },
        {
            "q": "I saw that there were some links to apply for the certification with Google in the course. Will we get a discount?",
            "a": "Paul: The certification that you see from Google is hosted and carried out completely on their end and doesn't involve Udacity. Therefore we have no influence over the price nor can we offer discounts on it.<br>Joanna: At the moment the answer is no, but that is good feedback that we can escalate. If we will offer a discount, that information will be shared out later in the scholarship program.",
            "track":"n/a"
        },
        {
            "q": "Are you guys thinking in getting student moderators on this phase? Because some channels can be confusing, and lot of people seem to get lost or end up using not the most appropriate channels",
            "a": "Yes, definitely! Student Reps was one of the aspects of Phase 1 that we enjoyed the most because we really felt like we could connect with more students across multiple languages. It's something we're currently planning on how to implement since all four tracks are now merged into one Slack. ",
            "track":"n/a"
        },
        {
            "q": "I received the Google Developer Nanodegree Scholarship and just today I got a chance to check it out. What do I have to do? I already did the first 3 apps, do I have to do them again?",
            "a": "You do not need to re-submit the projects if they already approved and say “Meets Specifications”.",
            "track":"n/a"
        },
        {
            "q": "Sorry maybe I've lost this notice and this aspect has already been clarified, but I want to ask if is possible to submit the project in a zip file and how?",
            "a": "Jose: Yes, it is possible to submit in a zip file and it is actually super easy. When you click on the submit project button you will see a screen with 2 options: One to upload a file and the other one to submit from a github repository. <br>My recommendation is that you use github because that way you can also show your repositories and code to potential employers by adding links to them in your CV. I know that it is a bit of an extra at the beginning but if you take the challenge to learn a bit of git and github you will see a lot of value on that. Plus it is an extra skill to add to your CV!<br>Feel free to ask for help in #git-github channel",
            "track":"n/a"
        },
        {
            "q": "I know ABND has not a career portal!  Is the reason because ABND student is yet to gain more skills to qualify for a job?",
            "a": "The Androids Basics course is just that, a basic course. It's an amazing precursor to the Android Dev ND, but it isn't a career ready program for this reason.",
            "track":"and"
        },
        {
            "q": "Why do android track have a mentor for the first 2 projects and the other tracks have him all the way?",
            "a": "Jose: I do not know 100%. What I can tell you is that not all the NDs have the same services. That does not mean that in one ND you are more important than in other or that you get more things in one ND or another. It is just that not all NDs have the same things.<br>Here you get the same things that any paid student would get + more things that are exclusive to you than any paid student gets. That includes this community, supported with mentors and Community Managers that are exclusive for you, the AMAs and all things that we have been doing and the surprises that we have coming.",
            "track":"and"
        }
    ]
},
{
    "datetime": "20-feb-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "Can we share our finished projects with each other, to see how others implemented it and learn from each other, or should we rather wait until the project deadline so there are no possible problems with plagiarism?",
            "a": "You can (and even should!) share your projects with each other, so you can learn from one another. But be mindful that we will track any traces of plagiarism – as we defined in Plagiarism section in our FAQs – your project submission should consists only of your own work and the code from other students’ Udacity projects should not be incorporated.",
            "track":"n/a"
        },
        {
            "q": "What is the best way to keep improving? I am at lesson 12 and all is again new to me. ",
            "a": "This is a great question and thanks for bringing this up – we will share more tips on this in upcoming days!",
            "track":"n/a"
        },
        {
            "q": "Is there a way to share all the suggestion we receive on a project's review? I find them very useful, and it would be great if we can share them someway or save them.",
            "a": "Jose: It seems that you are finding a lot of value on the code reviews. That's nice! There is not any automatic way to save the comments. You would need to copy them yourself. For external resources you may want to add the links to your bookmarks. And for sure that you can share!",
            "track":"n/a"
        },
        {
            "q": "Are there any plans to make the Careers Support Portal more useful to students outside the USA? I've been going through it and so far 90% of the material and external links are for people living in the USA only.",
            "a": "We’ve taken this feedback on and are working to fix it.",
            "track":"n/a"
        },
        {
            "q": "The time difference between my location and that of the mentor varies greatly. Can we ask for personal email so as to send in mails or something.",
            "a": "The only way to communicate with your Mentor is through the chatbox. I’m sure you can imagine the reasons for not providing the students with the Mentors’ personal details...",
            "track":"n/a"
        },
        {
            "q": "What does this button mean?",
            "a": "This button means that you don’t want to receive the Mentor’s support ever again. This is quite an extreme move and I wouldn’t recommend it. You don’t have to write to your Mentor if you don’t want to, or even interact with them at all, but maybe keep it as an option just in case. The Mentors are a very valuable resource, so we suggest you use them as much as possible for your own professional growth.",
            "track":"n/a",
            "attach": "uploads/mentor-out-button.png"
        },
        {
            "q": "How will career portal help me?",
            "a": "The Career Portal offers a complete recommended career development path, where you can track your progress and see all the foundational pieces needed to be ready to get a job. Think of the Career Track as offering a learning syllabus or fitness plan - you can learn or exercise on your own, but having a schedule and plan helps you better achieve your goals.<br>This includes CV review, LinkedIn profile review, a personal career counselling - depending on your personal path.",
            "track":"n/a"
        },
        {
            "q": "Can I change the email I was enrolled under?",
            "a": "You can change your account details in your classroom settings. this is the wheel-shaped icon in the bottom left side of your classroom.",
            "track":"n/a"
        },
        {
            "q": "When will you do a technical AMA?",
            "a": "We’ll host technical AMAs soon, we’re working on it. IN the meantime, the ND-specific Slack groups host “office hours”, which are effectively the same thing as technical AMAs. I advise you to use this service!",
            "track":"n/a"
        },
        {
            "q": "Which is better, taking the course material and then do the part of career portal or make the two parts simultaneously?",
            "a": "It’s better to try and stick to the suggested timelines – that is, to do them simultaneously. But your main priority are of course the projects. You’ll have some time between the projects (e.g. while waiting for them to be reviewed), so you can use this time for working on the career portal.",
            "track":"n/a"
        }
    ]
},
{
    "datetime":"19-feb-2018:04-05 PM CET",
    "type":"general",
    "questions": [
        {
            "q": "When we finish the nanodegree before the deadline, will we be notified if we will receive the diploma?",
            "a": "You’ll get an email with congratulations and certificate.",
            "track":"n/a"
        },
        {
            "q": "At some point it was stated people cannot receive two scholarships simultaneously. I'm referring to the data science one. This morning something else was stated, so I'm a bit confused.",
            "a": "As far as we know there is no limitation to the number of scholarships you can receive, as long as you’re eligible. But participation in one doesn’t improve your chances of getting another.",
            "track":"n/a"
        },
        {
            "q": "Do I have to pass all the quizzes to finish nanodegree or just accepted projects are needed? I will, of course, do everything but in Phase 1 some answers disappeared and I checked everything at least three times. I wonder if I have to do it in this part as well.",
            "a": "You need to pass all the projects. If you get stuck on a quiz, you can utilise the support services, but having all your projects reviewed and passed by reviewers is your main priority! Hope it answers your question.",
            "track":"n/a"
        },
        {
            "q": "In the selection email that says I got accepted is stated: 'Per the terms of the scholarship, you have committed to participating regularly in the program and if you have not logged-in and begun learning by March 1 (9 a.m. CET), you will lose access to your scholarship.'. What does it mean? is it ok if I manage to watch some videos and don't publish any project by 1st March?",
            "a": "This means exactly what is says - somebody who hasn’t even logged in in two weeks will be unenrolled. We want only people who are really interested in learning and appreciate this opportunity in this program. It says nothing about submitting of projects. Once you begin the course you can do it in your own pace, however the stipulated deadlines are highly recommended.",
            "track":"n/a"
        },
        {
            "q": "Are project reviewers different from the personal mentors?",
            "a": "Marat: Yes, the reviewers are usually not the same people as your personal Classroom Mentor.<br>Magda: Yes, project reviewers are different people than mentors. Both roles are there to support you, although they slightly differ – reviewers are there to review your code and give you feedback on it. Mentors, on the other hand, help you to do the project before you even submit it for the review.",
            "track":"n/a"
        },
        {
            "q": "Can we delete repositories on GitHub once our project has been submitted and passed or do we have to keep them until the nanodegree is over?",
            "a": "Jose: That's a tricky question. I guess that you can but that would create some issues. You will have a profile in careers at Udacity that would link to your project and your project will not be there. That will not be beneficial for you.<br>Also, why would you want to delete the repositories? One of the benefits of the ND is building a solid portfolio that you can show to potential employers. Adding links to your different projects/repositories in your CV is super important. It is the best way to show your skills.<br>If you do not want to do any of this, it is not compulsory to publish your projects on github. You can also upload them as a zip, but I would recommend that you upload them on github and leave them accessible for the future.",
            "track":"n/a"
        },
        {
            "q": "Can we ask for help from the mentor in case we get stuck on any of the projects?",
            "a": "Yes, that’s what mentors are for just remember that for both Android tracks, the in-classroom mentor will be available only for the first 2 projects. Later on the students of these tracks will be able to receive mentor support on forums.",
            "track":"n/a"
        },
        {
            "q": "You said that participation in one doesn't improve chances to get another scholarship. Does it mean that it decrease chances if you are doing another scholarship or it also decrease chances if you've finished some?",
            "a": "No, it doesn’t decrease your chances, but also doesn’t increase either. What I meant is that you won’t have any higher chances or extra credits for being a scholar. So you’ll be selected on an equal and neutral grounds with all the other applicants for that specific scholarship.",
            "track":"n/a"
        },
        {
            "q": "I quote: 'That means the a project has to be submitted 1-2 weeks BEFORE the deadline'. Will the project be accepted if sent at the last moment? ",
            "a": "Yes, this has been answered before, please read the announcements. Except the final deadline, August 15, all the other deadlines are not obligatory, but highly recommended to finish the course on time.",
            "track":"n/a"
        },
        {
            "q": "My first project passed all the criteria, however I would still like to improve and resubmit it. So far I haven't been able to figure out where to do this, I can only view my submission. How does it work exactly?",
            "a": "Once your project has been approved and accepted, you cannot re-submit it. However, of course you can keep working and improving it, but that would be for your own learning. You can then share your results on the forum if you want feedback from the community and the forum mentors.",
            "track":"n/a"
        },
        {
            "q": "Is there a grading system, so we know if we if the project was well done or just pass? Do the project have a grade for them affecting the final result of the Nanodegree?",
            "a": "Jose: Projects get only 2 possible results 'Requires changes' and 'Meets specifications'. There is no other grading or difference towards the certificate. In the old days we had 'Exceeds expectations' but that was removed long time ago.",
            "track":"n/a"
        },
        {
            "q": "Will we get study-buddies from donut this time? On the Phase 1 he got introduced in Slack a little bit too late and most people had already complete the course so there wasn't much students could talk about. ",
            "a": "You’re right, study buddies is a great way to learn, and this time we want to start early with this. The channels already exist: #abnd-study-buddies #and-study-buddies #fend-study-buddies #mws-study-buddies , but we’ll officially “launch” it next week, when everything settles down a bit.",
            "track":"n/a"
        },
        {
            "q": "I upload first project as a zip, but Jose recommend to upload them on github and leave them accessible for the future. so if I upload it again on github how to connect it to my profile in careers at Udacity.",
            "a": "Jose: I do not think that it can be done if you already passed. If you did not pass then you can use github when you resubmit. I would advise to use github as much as possible.",
            "track":"n/a"
        },
        {
            "q": "Are the credentials for completion given as soon as  all the projects are completed or we have to wait for the stipulated dates.",
            "a": "Magda: No, there is no need to wait until the (suggested) deadline arrives – once the reviewer approves your project it will be deemed as passed in your classroom.<br>Jose: Once you pass all the projects a button to graduate will appear in your classroom. Once you click on it, it will take around 1 week to check everything and receive the certificate.",
            "track":"n/a"
        },
        {
            "q": "How soon will I be able to get a one 2 one with a mentor about career advice? I have to be careful about putting myself out online too much so I don't affect my current job if you know what I mean.",
            "a": "After you finish the first 2 career projects, you have an option to schedule a 1:1 with a Career Counsellor in the time convenient for you. This is done completely privately on Google hangouts, and this information (as all the information about our students) never gets published externally (we take Data protection very seriously), so you should not be worried about that getting known to others.",
            "track":"n/a"
        },
        {
            "q": "My project is in review now for 24 hours, *not* pending! All the 24 hours is in review state, is there something wrong?",
            "a": "Jose: Reviews can take up to 1-2 weeks. You ned to be patient because there are many of you submitting the exact same projects at the exact same time and reviewers have a peak.<br>That does not stop you from moving forward. <br>If it is like that for a long time then you will need to ask to support or to the CMs to help to see if there is any issue. It is not common but sometimes it has happened in the past that a project gets stuck for some reason.<br>Marat: As you can very well imagine, our mentors just got thousands of new students they have to attend to, and the same amount of projects needed to be reviewed. They are doing their very best to reply to you all as fast as they can, but they are only humans (to all of you who thought they might be bots :stuck_out_tongue: :robot_face:).<br>In these first few weeks please be a bit patient and give them some time to respond. Some are very quick, and some might take as much as 48 hours to reply. Depending on their timezone and workload. Most of them actually have a day job in the industry – an that’s exactly what makes them into experts in their field and such a valuable resource for you to learn from!<br>As for the project reviews, it might take between a few hours and up to 10 days, exactly for the same reasons. That’s why we advise you to submit your projects as early as possible before the deadline.",
            "track":"n/a"
        }
    ]
},
{
    "datetime":"19-feb-2018:12-01 PM CET",
    "type":"general",
    "questions": [
        {
            "q": "After submitting my first project, I received feedback from the reviewer about some points. I will fix these. QUESTION: DO I HAVE SEVERAL DAYS TO RE-SUBMIT THE PROJECT? DO I HAVE TO COUNT IN RE-SUBMISSION INTO THE PROJECT DUE DATE (i.e. submit for review one week before due date if I expect that I will have to re-submit all of my projects)? ",
            "a": "Thanks for the question. First off, all of the deadlines are including reviews from the mentors, so please figure in that the deadline is when your project is submitted, reviewed and corrected. You should factor all of these things in in order to stay on track. Also, remember the deadlines are suggested deadlines to help pace students so you can submit projects after these dates. Keep in mind that you need to pace yourself to finish and have all projects reviewed and approved by Aug 15.<br>If you find a way to keep yourself on track while helping out your student cohort, that's great!",
            "track":"n/a"
        },
        {
            "q": "How many students each mentor has? The Mentors are not our Project Reviewers, correct?",
            "a": "Think of your in-classroom mentor as your coach to help you when you get stuck. We recommend checking-in with you your mentor and setting a cadence that works for both of you. Your classroom mentor will not only be able to answer your questions about the content, but they will also check in with you to help you stay on track throughout the duration of the program. There is no limit to the amount of questions you can ask your classroom mentor. However, please note, that classroom mentors are expected to respond within 24 hours. If you are looking for immediate assistance, I would recommend reaching out to your classmates.",
            "track":"n/a"
        },
        {
            "q": "I have a question about the optional part (Career part). I saw the deadlines are the same as the main projects, so what is your recommendation? Finish them on time (two weeks earlier, because they work as the main ones, right?) or when we finish the main projects?",
            "a": "Your main priority is of course the Core curriculum, i.e. the Projects, as without them you won’t be able to graduate. The extracurricular tasks are extra, but still very recommendable, as we want you to be fully career-ready by the end of the course. So try to incorporate them into your schedule as much as possible. As with all the timelines, they are not mandatory, but suggested, so no harm will be done if you submit them a bit after the deadline. They are just a bonus, however a highly advisable one.",
            "track":"n/a"
        },
        {
            "q": "MWS: If I think my project is ready, but it doesn't fulfill 100% of the criteria, will code-review send it back and give me the chance to improve? In other words - I'm only interested in submitting perfect 100% done work. Will CR help me, ensure I meet my goal? ",
            "a": "Thats a great question. It's important to keep in mind that the mentors are helping out several people at once, and if you submit your project at a time when several other students are submitting their projects, there will be a queue.<br>It's okay if you still are not 100% sure about your project, but try to use channels like #live help or other such channels to get your questions answered beforehand instead of just relying on the code review.",
            "track":"mws"
        },
        {
            "q": "I have read in the FAQs that submission deadlines are not mandatory. However, is it mandatory to log on the classroom continuously during the 6 months or is it really completely self-paced?",
            "a": "Joanna: The course is indeed self-paced, but there are a few things to note: First, make sure that you log-in to your classroom in the first 2 weeks. We will unenroll students who have not logged in during this time. Second, you have a hard deadline of August 15th to finish the course. You should make sure that you pace yourself so you can submit projects and have them finished, reviewed and approved by Aug 15.<br>Marat: The program is self-paced and you can schedule your time the best it works for you. The deadlines we recommend are highly suggested though, to help you plan your time the best way to get you to graduation!",
            "track":"n/a"
        },
        {
            "q": "I still don't have the career option on my page and I think it's not clear for everyone if this should be on every student's page, or appears randomly. ",
            "a": "Not every Nanodegree has career options. AND, MWS, and FEND have the Career Portal. Android Basics unfortunately does not.",
            "track":"n/a"
        },
        {
            "q": "How we get certificate also from Google?",
            "a": "This scholarship covers the Udacity Nanodegree program and the certificate you get in the end of it. The Google Developer Certificate is an external examination, which is not included in this program. After graduating this Scholarship you’re supposed to be ready for it, and can attempt the exam at your own expense.",
            "track":"n/a"
        },
        {
            "q": "Where can I find this career portal, which was mentioned by Joanna?",
            "a": "The portal can be found in your Udacity classroom. As mentioned, it is in the left sidebar and looks like a briefcase!",
            "track":"n/a"
        },
        {
            "q": "I've signed up for Data Analyst scholarship. Should I finish this course before you'll be choosing lucky ones for that scholarship to have chances to get there? ",
            "a": "That's awesome that you want to do the Bertelsmann scholarship! You can indeed be enrolled in both, one suggestion is to make sure that you are keeping track of both deadlines.",
            "track":"n/a"
        },
        {
            "q":"Android Developer track: On the Udacity emails there is only mention of this slack and a Google+ community.  Your website mentions that there would be a second slack group including all ND students. Some people found a slack: androidnanodegree.slack.com which is not active. Which groups should we use to interact with all students in our track?",
            "a": "The Android Advanced track doesn’t have an additional Nanodegree-specific slack channel, but a Google+ group. All the services available to your track you can find in your “1st day of class” email from Feb 15 and in your Classroom.  We’ll repost these announcements later today as well.",
            "track":"and"
        },
        {
            "q": "Are we going to be able to access and submit the extra curriculum projects after the final deadline (August 15)? ",
            "a": "Joanna: Thanks for the question. As a Nanodegree program graduate, you will retain access to your programs materials for a period of time after graduation, and you may download certain materials for your own records if you wish. You can also utilize what's available in the extracurricular section.<br>Marat: August 15 is the final deadline for the scholarship. Everything should be submitted beforehand. If you finish everything and graduate from the program, you’ll get additional career services as a part of our Nanodegree Alumni community.",
            "track":"n/a"
        },
        {
            "q": "I have project done and it says 'Excellent work! Congratulations on the completion of this project!' on project review.. and then only suggestions so no mistakes.. so do I need fix those suggestion? Also can you put Croatia to career portal so we can put is as location?",
            "a": "With such congratulation there no need to resubmit. It’s accepted. The suggestions are just for your own improvement.<br>As to adding a country, this is also mentioned in our form, please fill it in:https://goo.gl/forms/oG6Y4eWIfJLCIyRa2",
            "track":"n/a"
        },
        {
            "q": "Is there a list or website for all the scholarship that Udacity offer? I have found https://www.udacity.com/scholarships but I believe is either for USA residents or are not all, I don't find the Bertelsmann scholarship there.",
            "a": "The Bertelsmann Scholarship is available and you can indeed apply, it just has not be updated on the site.",
            "track":"n/a"
        },
        {
            "q": "Is the quality of the projects and the number of submissions reflects in the graduation of the program?",
            "a": "No, there is no limit to the number of times you can re-submit your project, and as long they all *meet the specifications* by the end of the scholarship, you are good to go!",
            "track":"n/a"
        },
        {
            "q": "Slack deleted the AMA sessions dates' post in #general_announcements! Is there a more stable source to get the dates? I found today's session by luck!",
            "a": "We are working on it! We will have a clearer calendar on the site, and will update you all when that happens. Keep checking it!",
            "track":"n/a"
        },
        {
            "q": "Can I use the code I have found in Stack Overflow site in my own project? If yes, should I put a link to the source? ",
            "a": "That's a really great question. We have a plagiarism policy that is stated in the Honor Code, which everyone agrees to when they use Udacity Services.<br>By agree you are confirming that your project submission consists only of your own work and that code from other students’ Udacity projects have not been incorporated.<br>A project is flagged for plagiarism when a student has copied any part of another student’s work, even with attribution. Hope that helps!"
        },
        {
            "q": "I'm in touch with many other students from my country. Somebody has received suggestions that differs from each others. Is there a common guideline for the suggestions we can receive from the reviewers or are they base on how we code/personal consideration of the reviewer?",
            "a": "Naturally different reviewers will have different suggestions or styles, and naturally it will also depend on each individual project. Since you definitely won’t submit the same code (definitely!) - the responses will vary. But that’s what you have the community for - if you want, you can always share your suggestions and earn from each other.",
            "track":"n/a"
        },
        {
            "q": "Could you please make some update of the project 'deadlines' for FEND? I know they are not obligatory, but it would help me a LOT to plan my studying. Right now there are even deadlines for September which is misleading.",
            "a": "Working on it. We’ll post an update about the dates in the coming days.",
            "track":"fend"
        },
        {
            "q":"Is there a chance that ABND students will get some discount for the AND once they finish the ABND? ",
            "a": "Awesome suggestion. It would be great to keep you guys engaged and learning more, and a discount is a good idea. I will take your feedback and we can talk again towards the end of the program in August.",
            "track":"and"
        },
        {
            "q": "With the amount of posts in this Slack channel, if you are away for a few days, all of the general announcements etc can no longer be seen (for all those who haven't paid the premium).  Can you please post all the important announcements on your google page or make them stickies on slack?",
            "a": "You can already see the announcements being saved in the backlog of the #general_announcements channel. Just check the _pinned items_. We’ll repost the most relevant announcements more often as well.<br>Also, we’ll keep updating our new website with the most current updates on a regular basis, just just keep checking https://sites.google.com/knowlabs.com/gdnd2017/updates.<br>We’ll also keep sending you newsletter as per usual.",
            "track":"n/a"
        },
        {
            "q": "I am enrolled to MWSND yet I don't have Career Portal at my ND page and I didn't even receive that hr question at the start,  I only See Google Certificate. is that normal ? is it meant for some countries only?",
            "a": "You can find the Career portal by going to the briefcase icon here:",
            "track":"mws"
        }
    ]
},
{
    "datetime": "16-feb-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "I have a question regarding mentors. Is there a possibility to change a mentor because my mentor seems to have less/the same experience as me preety much. Also do mentors review our projects? Because I've uploaded one of mine, got rejected, reuploaded it and got accepted without changing anything but just pointing out one thing that wasn't even that hidden in code. Like the person didn't even look in my code ~~ (Also no contact with my mentor for more than 24h already).",
            "a": "Changing your mentor should be possible. I'm going to inquire a bit more about this process and let you and others know what to do in this situation. (Paul)",
            "track":"n/a"
        },
        {
            "q": "Hello,<br>1- Can i submit more than one project at the same time? as we already finished first 3 project.<br>2-I want to know what is the next step after this ND, I am in ABND and want to know when we finished, is there any advice or steps to follow after finishing this scholarship ?",
            "a": "You can submit more than one project at a time, though some folks might find it helpful to incorporate mentor feedback from one before submitting the second. You can do what fits you best. as for when you finish the course, there isn't anything else you need to do and Udacity will certainly keep in touch with you at that about any end certificates. (Paul)",
            "track":"and"
        },
        {
            "q": "Hello, I am still a bit confused concerning the very first project deadlines. Does it matter, if I submit the first 2 projects one month later? I am asking, because in the email is stated that we would lose the scholarship, if we had not started learning before 1st March. My mentor says that the deadlines are usually 'soft deadlines'",
            "a": "Like Phase1, the program is self-paced and you are free to schedule your time the best way it works for you – as long as you have all your projects submitted and approved before the end of the program (August 15).<br>The deadlines are there just to help you organise your time, as they are based on historical projections and take into account the average amount of time needed for each project. That’s why they are much recommended.<br>The part in the email about losing your scholarship means that it will happen if you will never even log into the classroom in two weeks after the start of Phase 2. It doesn’t refer to submitting projects. (Marat)",
            "track":"n/a"
        },
        {
            "q": "Is it possible to access the 2nd slack now? If so, how? Thank you.",
            "a": "A1:you will find the access link in your “1st day of class” email from Feb 15, as well as in your classroom. (Marat)<br>A2: I'm assuming you mean the 2nd Slack just for your ND and not the Scholarship slack?<br>If so, head to your classroom, enter a chapter, click on a lesson, click on your resources tab and you'll see the forum link.<br>This is...a process. We know. (Paul)",
            "track":"n/a"
        },
        {
            "q": "I have a question about all the slack channels we are meant to be following. There are way too many and I can't spend my day reading all the messages, instead of doing the work. Which ones are the important channels to follow? Thank you.",
            "a": "You are a proper Nanodegree student now – there is no challenge. So other than submitting the projects (advisably before the deadlines), nothing is obligatory. You can use any platforms you want and follow any channels that are most useful for you.<br>All the services are there to help you study and succeed, and we recommend using your mentors and peers as much as you can, but it’s all up to you. (Marat)",
            "track":"n/a"
        },
        {
            "q": "Will it be careers section for ABND? Inside program on Udacity.",
            "a": "ABND is not one of our career ready ND programs as it is just a basic program. (Paul)",
            "track":"and"
        },
        {
            "q": "Hi Everyone, I am just curious. After successful completion and graduation of the ND Program, what Next? Is there Another Phase?",
            "a": "After a successful completion and graduation of the ND Program there is a graduation party!<br>There are no more Phases - you get a certificate from us and become a Developer!<br>If it’s applicable to you, you can also attempt the Google Developer Certificate, but that’s an external examination, and not a part of this (Marat)",
            "track":"n/a"
        },
        {
            "q": "Hi everyone, I hope that is the right place to ask this. Are we encouraged to share our projects here like in first phase to get some ideas and advice from others how can we upgrade our projects before actually submitting in the classroom or should we be aware of that, because it increase the chances that we copy pasting from each other some code snippets?",
            "a": "A1: You can continue to share projects and help each other out. The most crucial thing is that when the time comes to submit a project, what you're submitting is 100% your code. (Paul)<br>A2: great question! Our core value still is, and always will be, _Better Together_, so of course we still encourage you to use your peers for feedback, mutual learning, and sharing ideas. That said, we trust you all will be professional and respectful enough not use this to anyone’s disadvantage. (Marat)",
            "track":"n/a"
        },
        {
            "q":"Said that ABND is not one of our career ready ND. MWS is? If so, what does it really mean - career -ready?",
            "a": "MWS, FEWD and AND are career ready. What this basically means is that, upon successful graduation, you'll be able to make use of our careers team for various things such as resume review, LinkedIn reviews, and more. (Paul)",
            "track":"n/a"
        },
        {
            "q": "Are 1on1 mentors assigned randomly or is there some kind of selection? No answer for 35h, I feel others are more lucky with who they have assigned.",
            "a": "Mentors are global so they are working across all timezones. Please expect a 24-48 hour turnaround on answers so they may not be online the same time as you are. That said, as I said to another student I'm going to inquire about the processes of changing your mentor and/or sending feedback for special circumstances. (Paul)",
            "track":"n/a"
        },
        {
            "q": "Hi mentors, after submitting my project I received a feedback from the reviewer about some points should I correct those points and resubmit the project or what should I do, and also is there any marks evaluating our projects?",
            "a": "You are correct - this is exactly what you should do. Receive feedback, implement it, and resubmit. There are no marks.<br>Don’t think about these projects as school projects, but rather as work projects. That’s also why the projects have to be all ready BEFORE the deadline. (Marat)",
            "track":"n/a"
        },
        {
            "q": "I saw in a post in the previous challenge ' phase 1 ' for a person that you will make us more access on Slack like seeing the history of chat and some stuff like this.Now I'm not seeing this access Why ?",
            "a": "I think that person might have been referring to your Nanodegree Slack Channel. The ND programs have their own dedicated Slack groups. This Slack here is just for the Scholarship Phase 2 recipients while the other is where you'll be interacting with paying ND students as well. You can find that Slack invite link in your day one emails. (Paul)",
            "track":"n/a"
        },
        {
            "q": "Are we going to get a seperate forum for the Scholarship lot or is it the combined one that we can see for the full program? There is some mention about another mentor forum, is that another thing? (FEND)",
            "a": "yes, the Phase 2 forum is not connected to the one from Phase 1. That’s why you need to log off from that one and log into the new one again. (Marat)",
            "track":"fend"
        },
        {
            "q": "Quick question, why do some videos of the Nanodegree that are posted on youtube have names in Japanese in the Title, or Portuguese sometimes ? Is there a reason?",
            "a": "Udacity operates around the world, and some of our content is localised for the Brazilian and the Chinese markets. So this is probably the content that you have seen. (Marat)",
            "track":"n/a"
        },
        {
            "q": "Will there be different workspaces for the 4 tracks or just a workspace with dedicated channels?",
            "a": "Each of the 4 tracks have their own dedicated Slack channels where you can work alongside paying ND students. The invite links to your respective channels can be found in your day one emails. This Slack channel is just a separate space for only the Scholarship students. You can also use #fend-live-help, #mws-live-help, #abnd-live-help or #and-live-help  in this Slack to work with your peers. (Paul)",
            "track":"n/a"
        },
        {
            "q": "Should we study the Core curriculum first then the Extra curriculum? or we should study them simultaneously?",
            "a": "Because I found that there are some projects in the Core  their deadline for example are 4 months from now, and some projects for the extra (Career) their deadline are 2 months from now.<br>Your main priority is the Core curriculum, as without completing all the projects on time you won’t be able to graduate. As for the extracurricular activities - they are just a bonus. We still recommend doing them simultaneously, as we want you to get the best support possible to be fully career-ready after you finish the course, so try fit them in together into your schedule, while prioritising the actual course. As with the projects, also the extra deadlines are not obligatory, but just suggested. (Marat)",
            "track":"n/a"
        }
    ]
},
{
    "datetime": "16-feb-2018:11-12 AM CET",
    "type": "general",
    "questions": [
        {
            "q": "Did you had to refuse a lot of people who have fully completed the first phase? Do you have a stats for each track?",
            "a": "Sadly, yes. There were lots of students who finished Phase 1 and it made the selection process not only difficult, but heartbreaking. We have a lot of stats, but we're still inquiring about which ones we're allowed to share.",
            "track":"n/a"
        },
        {
            "q": "Are all the projects we submit still our property and for us to sell in the Play Store or are we handing it over to udacity, when submitting?",
            "a": "You own everything you make.",
            "track":"and"
        },
        {
            "q": "Should we post anything in the socials to be successful in the phase 2? Is there any pic to show as per phase one?",
            "a": "I'm not sure I fully understand your question, but if you're asking if Phase 2 has a social component like Phase 1, it does not. The social and community participation we required in Phase 1 was to help make candidates stand out. You're all in Phase 2 now, so you can really focus on the work ahead of you because, depending on your skill level, it can be a lot. ",
            "track":"n/a"
        },
        {
            "q": "Will some more students be granted access/get selected for the 2nd phase after 1st of March, if there will be people who do not start their Nanodegree as requested in the initial email?",
            "a": "Yes, there is a waitlist and we might be able to enrol more people after the grace period. we will keep you guys updated on that.",
            "track":"n/a"
        },
        {
            "q": "There's no forum for MWS but it seems our Slack channels gets purged pretty often, are there options to keep our MWS channel available for a longer time?",
            "a": "The MWS ND was designed without a forum in mind. Since the challenge phase curriculum was specially built for phase 1, we were able to include a forum. Now, MWS scholars are being integrated into the already established ND. It's certainly food for thought and we're listening to the feedback on what our students want.  As for the Slack channels here, unfortunately we don't have any say on how often Slack will purge the message history. If we could keep things longer, we would. I would also encourage you to make use of the MWS ND Slack channel that exists for all MWS students.",
            "track":"mws"
        },
        {
            "q": "In the office hours in the official ND slack community we can ask technical question? Or will be a technical AMA for tech question?",
            "a": "Yes, thats correct, the ND slack communities have the Office Hours that are there to help you with any technical questions you might have. But make sure you reach out for help on Forums and in chat with mentors. Not mentioning the great community here on scholarships slack.",
            "track":"n/a"
        },
        {
            "q": "Do you have stats about career evolution for people who got the nanodegree?",
            "a": "Good question! I'm going to take this one with me to our next meeting and see if these exist.",
            "track":"n/a"
        },
        {
            "q": "In the mail we got yesterday, there was nothing said about the forum, will we be using it in phase 2?",
            "a": "Hey there, not all the tracks have forums available, you can find the full list of services & communities offered in each track in our FAQ.",
            "track":"n/a"
        },
        {
            "q": "I don't see nanodegree on my classroom. It is enough writing to one of community managers on slack or better write elsewhere.",
            "a": "We honestly get hundreds of messages each day and it's impossible to respond to everyone as much as we'd like to. Slack erasing message histories doesn't help the situation. For all bugs and technical issues, I would recommend you send an email to support line. A response should come within 24-28 hours (not counting weekends) -- scholarships-support@udacity.com",
            "track":"n/a"
        },
        {
            "q": "Is there a FEND forum? We are somewhat confused.",
            "a": "There is a FEND forum. It is up and working. But I'm seeing now that many of you are having trouble with access. I'm going to inquire about this and post an announcement in #fend once I have a solution.",
            "track":"fend"
        },
        {
            "q": "Is there an overview for deadline dates somewhere? I can't find anything on the Google site, and I wonder if I have to scout through the whole course for them.",
            "a": "We will publish it on the site early next week. so pls make sure you check the Updates section regularly!",
            "track":"n/a"
        },
        {
            "q": "Are the planned hackathons obligatory to get the certificate? Or are they organized just for our fun, practice and experience?",
            "a": "The hackathons and other events organised by us will not be mandatory, but will definitely be fun and helpful.",
            "track":"n/a"
        },
        {
            "q": "Can you move the ama-sessions to evenings, as some people tend to work during daytime? Like me, eg.: I might be home at 18:00 or later depending on travel time. However, on weekends I'm mostly at home, if there are no plans.",
            "a": "Sure, we get that some people work during daytime – we belong to this group as well :grin: but that’s what the AMA transcripts are for, again – you can always find them there: https://sites.google.com/knowlabs.com/gdnd2017/updates",
            "track":"n/a"
        },
        {
            "q": "What's the idea behind 2 Slacks: for all students and the other one for particular track? Should we use them for different things?",
            "a": "1 Slack is for just the recipients of the Scholarship - the 6,000 of you. The other Slack is the official ND Slack channel. On these channels you'll be integrating with paying ND students and it could be a great place to receive help and advice from students who are probably near the end of their own ND.",
            "track":"n/a"
        },
        {
            "q": "Regarding classroom mentors for tracks that have access to that feature - some people have already had contact with theirs, and some have been waiting to hear back. That's obviously totally normal given time zones and mentor workload etc. as you mentioned yesterday, but as a general rule, within what timeframe should students have heard back and, if they haven't, should they provide feedback on that, and what's the best way to do so?",
            "a": "Because the mentors are having 1:1 conversations with many students, I'd say to give things 24-48 hours for a response.",
            "track":"n/a"
        },
        {
            "q": "When we have code related problem, can we ask our mentor for help?",
            "a": "You betchya!",
            "track":"n/a"
        },
        {
            "q": "Why is my Core Curriculum different from another student? Both FEND and I don't have the the career services icon. just had the mentor icon yesterday at 23h56",
            "a": "I'm not...entirely sure. I'll mark this question down for now and get back to you once I confirm why this happens (and if it should happen)",
            "track":"n/a"
        },
        {
            "q": "What is a hackathon, where can we join and what skills do we need?",
            "a": "It can be an online (via live stream) or in-person event (where everyone is together in a room) where students all work on chunks of projects together and are lead by the mentors. It's a great energy to experience and it really helps students break down projects together and get past any road blocks. We don't have any planned as yet, but we are planning to do them. Once we have details, we'll be sure to announce it to the specific tracks",
            "track":"n/a"
        },
        {
            "q": "Can I ask my mentor about a code issue I'm having with an outside project? I'm trying to build sites to apply what I learn here.",
            "a": "Mentors will only be able to help with questions related to projects in the ND.",
            "track":"n/a"
        },
        {
            "q": "The thing is a lil bit confusing in the forum, what's the actual FEND actif chit chat room?",
            "a": "It’s called Social Chat Feature is a group-chat where you can connect with other students inside the classroom. more details here: https://sites.google.com/knowlabs.com/gdnd2017/faq",
            "track":"n/a"
        },
        {
            "q": "Can I use in projects tools or materials that we didn't learn in the lessons? For example Bootstrap.",
            "a": "This may be a better question for your mentor as we're not entirely sure about it and these know these programs like the back of their hands. ",
            "track":"fend"
        },
        {
            "q": "How could we access general_announcements previous messages if we reached the 10000 slack limit?",
            "a": "You can't, and neither can we. Slack can be annoying like that :confused: Not to worry, we'll repost important announcements and encourage everyone to follow our google site for important info:  -- https://sites.google.com/knowlabs.com/gdnd2017/updates?authuser=0",
            "track":"n/a"
        }
    ]
},
{
    "datetime": "15-feb-2018:04-05 PM CET",
    "type": "general",
    "questions": [
        {
            "q": "Do we need to resubmit the projects we have already completed to our mentors? The first deadline is said to be on the 1st March but I don't see the what I need to do now - unless sending to my mentor the already completed apps.",
            "a": "You need to submit your projects for review in your classroom, the deadlines are there to help you pace your own learning experience. It is important to remember that deadlines are met when a project is submitted, reviewed and deemed as *passed*.",
            "track":"and"
        },
        {
            "q": "Is there somewhere where you list all the deadline dates on the abnd course within the 6 months so we can arrange our own timeline?",
            "a": "not yet but soon – all the deadlines (for all tracks) will be listed early next week in the Updates section of our google site. So please check it regularly, we will be posting there news and updates almost every day!",
            "track":"n/a"
        },
        {
            "q": "You advise us to post projects 2 weeks before the deadline, but, in the Android developer track, the first project is due in only one week! Is that okay?",
            "a": "Yes, just try and submit it as soon as possible, to give the reviewers enough time to check it. The two-weeks guideline is more about the next projects.",
            "track":"and"
        },
        {
            "q": "If a my submission is not passed, what's happen? Can I correct it and submit again?",
            "a": "In case your submission is not passed, you can try to improve it and submit it again. In general there are no limits, and you can try as many time as you want, however, we recommend you always to be mindful when you do that – reviewers need between 1-2 weeks to review your work, so every time you submit it, please make sure this is the best version that you have. It’s always recommended to reach out to community and mentors for feedback before you decided to submit your work. Good luck!",
            "track":"n/a"
        },
        {
            "q": "Do we obtain the nano-degree after completing the course in full or do we get rewarded at the end of the 6 months? E.g. if I finished in 3 months, would I obtain the nanodegree then or would I have to wait another 3 months?",
            "a": "you will obtain the Nanodegree if you passed all your projects within 6 months period. If you managed to do it before the final deadline on August 15 – good for you! :slightly_smiling_face: but the final graduation will happen after that date.",
            "track":"n/a"
        },
        {
            "q": "Regarding the deadlines and projects being reviewed and deemed as passed…_ in case we fail to submit a project 2 weeks before the deadline and, let's say, the project gets submitted 2 days before the actual deadline, what will happen? Will the project never be deemed as passed?",
            "a": "Marat: If you submit your project 2 days before the deadline, then it probably won’t be reviewed in time. During the course failing to meet deadline is inadvisable, but possible, whereas failing to meet the final deadline means that you won’t get the Nanodegree certificate.<br>Historically though, we know that failing to keep up with the deadlines during the course usually leads to not finishing it. This course – and this profession – is all about strict time management and meeting deadlines on time.<br>Magda: as long as the submitted project is correct, it will be deemed as passed. The deadlines are there to help you pace your learning experience, but the only hard stop is the final deadline on August 15. If you don’t manage to meet any of the deadlines in the meantime, you can still continue, it just might be harder for you to meet the latter ones as you go. Hope that answers your question!",
            "track":"n/a"
        },
        {
            "q": "There is some confusion about mentors in the Android NDs. The FAQ says they will be around for the first two projects but some students have gotten the answer from their mentor that they will be around throughout. Also, are the first two projects the first two we did in the challenge part?",
            "a": "this is correct: in ABND and in AND the classroom Mentors are only available for the first 2 projects (and yes, if they are identical, they are identical, or you can still improve them a bit). After the second project, you’ll have in-forum mentors, like it was in Phase 1.",
            "track":"and"
        },
        {
            "q": "can you explain your 3.? The nanodegree specific is #anbd, #and, #fend and #mws, right? Are there people there not in the scholarship?",
            "a": "yes, these are slack groups for ALL the Nanodegree students, both Scholars and paying students alike.",
            "track":"n/a"
        },
        {
            "q": "My mentor hasn't replied to me yet, why is this?",
            "a": "They need time to reply to all the other students that they support, plus they are usually in a different timezone. So usually please give them a few hours or even a day to reply. They will give you their undivided attention as soon as they can, I promise.",
            "track":"n/a"
        },
        {
            "q": "Hi guys, Is there another workspace for front end nanodegree only? And what we should join here or there or both?",
            "a": "in general you have two slack workspaces available: this Slack team for all scholarship students, and additionally a Nanodegree Slack team for your specific track. Here’s the link: https://fend-slack-invite.herokuapp.com/ (can be found in Marat’s announcement in #fend)",
            "track":"fend"
        },
        {
            "q": "In the first phase, we were selected based on our activity and course completion. What are the criteria to get the certificate? Submit and pass all the projects? Continue being active on forum and slack? I know being active is recommended in order to learn and improve our projects, but I'm strictly talking about it as a necessity to pass, like in the 1st phase.",
            "a": "In order to receive the Nanodegree you need to submit and pass all your projects before August 15. Slack and Forum activity will definitely help you along the way, but we won’t be tracking it anymore as we did in Phase 1.",
            "track":"n/a"
        },
        {
            "q": "Is it okay if I submit the project earlier  than 2 weeks before the deadline?",
            "a": "yes, it is even recommended, as it takes time for reviewers to check it. and in case there is something you will still need to correct, you will have more time for that.",
            "track":"n/a"
        },
        {
            "q": "As FEND students we have 3 projects 'completed'...correct me if I'm wrong but now we must submit them to be checked by mentors for passing?",
            "a": "Yes, the first 3 projects in FEND are the projects you were already working on in Phase 1. You can submit them now for the review. It might be good though to submit one at time, since the learnings you get from the reviewer’s feedback after submitted project 1, might help you improve the remaining 2 projects before you actually submit them. Which might increase the chances of having them deemed as passed even after first submission!",
            "track":"fend"
        },
        {
            "q": "Will Google Scholarship degrees' participants have to pay the $99USD for the final exam?",
            "a": "This scholarship is only for the Udacity Nanodegree Program. The Google Developer Certificate is an external examination and is not included in this scholarship.",
            "track":"n/a"
        },
        {
            "q": "Can you please tell us more about evaluation part at the end of the course?",
            "a": "You need to pass all the projects. If you get stuck on a quiz, you can ask the support services for help, but having all your projects reviewed and passed by reviewers before the final deadline is your main priority!",
            "track":"n/a"
        },
        {
            "q": "The Android Basic track is too basic for me. May I move to the intermediate level Android Developer track instead? This is really important for me.",
            "a": "At this stage we can’t accommodate any track switches. I’m sorry.",
            "track":"and"
        },
        {
            "q": "Do you have a recommendation for a minimal amount of hours a week I should dedicate to the course?",
            "a": "Great question! We estimate that you should spend an average of 10 hours on your course and coursework each week - some will need more time, some less. Just be sure to keep in mind the final deadline of Aug 15 when the program will end.",
            "track":"n/a"
        },
        {
            "q": "One quick question, the amount of time we spend on each lesson is still being monitored?",
            "a": "There is no challenge this time, so your activity won’t be monitored like in Phase 1. It’s completely self-paced, but we strongly suggest you to stick to the stipulated deadlines.",
            "track":"n/a"
        },
        {
            "q": "1. Can you give the link to the proper slack channels (ie. for Android Developer Nanodegree Program)?<br> 2. The Slack becomes confusing, especially when some fellow students do not respect green/red lights. Will the AMA answers be published in the forum too?`",
            "a": "1) the link was in the welcome email + in the announcement from Marat in #and <br>2) all the transcripts from AMAs will be collected and published on Google Site Updates section: https://sites.google.com/knowlabs.com/gdnd2017/updates (you can already find there the link to the AMA that took place earlier today).",
            "track":"n/a"
        }
    ]
},
{
    "datetime": "15-feb-2018:11-12 AM CET",
    "type": "general",
    "questions":[
        {
            "q": "I was wondering: *once we complete the Nanodegree and get our certificate, will we still have access to the course material? For some time? Indefinitely?",
            "a": "@Manoel, Because the program is a scholarship, you have a hard stop on what you can access. The end date is August 15th.",
            "track":"n/a"
        },
        {
            "q": "Hi mentors! Awesome to be a part of another AMA. Here's my question: What is the role of our personal mentors (i.e. how much are we allowed to bother them)? Should we still rely on peer help more and discuss only projects with them?  In any case, it's amazing to have guidance!",
            "a": "@Ozana Yes, you will be assigned an in-classroom mentor for the program. You will see you mentor pop up in a chat box once you log-into your classroom. Please utilize your mentor to check-in and set goals. They are an amazing resource! You can message them when you need their guidance, but just keep in mind their responses may not be immediate since they also aid other students",
            "track":"n/a"
        },
        {
            "q": "Will we get a forum for phase two? Feels bad to post in the old one because of all that didn't make it to the second phase. I miss the forum already! Would be nice with a forum with all tracks but with sub-forums within it.",
            "a": "@mattias.lonn It depends on your program. MWS is the only program that does not have forum access Hope that helps!",
            "track":"n/a"
        },
        {
            "q": "What if i fail to submit the project before the due day? Do i lose the chance to graduate from the Nanodegree??",
            "a": "@Tasos You won't lose access to the ND. These due dates are *highly recommended* guidelines set by our course designers. Historically speaking, students who miss the first deadlines are very likely to not graduate from the ND since the work piles up and can become just too much. We also suggest that you submit the course projects two weeks before the deadline since you'll still need to time to edit your projects and submissions with the feedback you receive so that your project can be approved by the due date.",
            "track":"n/a"
        },
        {
            "q": "I am in the Android Developer Nanodegree and I can see 2 of the projects (the 2 Pop Movies apps) as already finished because I already did them in a previous scholarship for the Android Developer Fast Track.**Is this correct or should I re-submit the projects? At the moment there is no possibility for submitting these 2 projects in my account.**",
            "a": "@Alessandra The projects will carry over and have already been submitted.",
            "track":"and"
        },
        {
            "q": "Many application have discount for students we can use that discount to?",
            "a": "@LepiDecko The coupon is something we generated for the students who were not selected to be in the Scholarship ND. We really wished we could have taken everyone in, but sadly, this was not the case.",
            "track":"n/a"
        },
        {
            "q": "When the course finishes do we get our certificate shipped? and if so do we have to pay for the shipping?",
            "a": "@Nicolae It's a digital certificate",
            "track":"n/a"
        },
        {
            "q": "1.Will there be AMA sessions for each track? (I mean separately for each one)<br>2.Can we copy and paste the project from Phase 1 or should we start them from 0?",
            "a": "@Radu Alexandru<br>1.) Just for now, we are doing General AMAs, but we will get back to you regarding track specific AMAs. Thanks for the question!<br>2.) As long as your work is original work, you may carry over work from the first Phase into this Phase",
            "track":"n/a"
        },
        {
            "q": "Why *MWS is the only program that does not have forum access*?",
            "a": "@xvs That's how the MWS program was designed. We were able to include one for the challenge phase because that was a specially set program, but now that we're in the full ND, you're being integrated into Udacity's courses and they way things are normally done. That said, we encourage you to make use of the Slack communities and our AMA sessions. Once we're past this first week of general AMAs, we'll also start to hold track specific AMAs so that we can support you all in the best ways possible.",
            "track":"mws"
        },
        {
            "q": "Can we get a list of all the project deadline dates in advance?  This will allow us all to plan our study around any periods of holiday/unavailability.  At the minute I can only see them for the first section of FEND. Thanks.",
            "a": "@Tim Great question! We will update the Google Site with deadlines so you can visualize them more easily. The site will be up and running in the next few days so stay tuned!<br>In the meantime, in the course the projects say in how many days the coursework is due.",
            "track":"n/a"
        },
        {
            "q": "Do we all have a chat in the classroom? Students from other programs said they have, but I don't. Mine is Android Basics.",
            "a": "@Theatralka As of right now, the chat function built into the classrooms have been rolled out to FEND and MWS. This may be rolled into more NDs in the future, but at this time there's nothing to confirm or even speculate on since it's fairly new and still being tested in specific NDs.As of right now, the chat function built into the classrooms have been rolled out to FEND and MWS. This may be rolled into more NDs in the future, but at this time there's nothing to confirm or even speculate on since it's fairly new and still being tested in specific NDs.",
            "track":"and"
        },
        {
            "q": "Weren't we supposed to be 6000? We're missing 2500 scholars. Where are they? It's hard to believe that people who spent 3 months in this challenge did not checked their emails. Were the scholarships' quotas modified?",
            "a": "@T.Violeta 6,000 people have been accepted. Just not everyone has seen the welcome email yet and/or had time to set up their Slack accounts.",
            "track":"n/a"
        },
        {
            "q": "Is there a way to go from the Android basics to the Android advanced after completion (or any other track for that matter)? If so, How? Does it get extended to the full ND after successful completion?",
            "a": "@Dzengiz The scholarship is just available for the track that you are already in. If you would like to do another program, you can enter as a paying student.",
            "track":"and"
        },
        {
            "q": "Guys, can you please address people's complaints? I'm in, but feel bad now.",
            "a": "@Kira Are you referring to the students who were not selected to Phase 2? We're aware of what folks are saying (I'm managing the FB group as well) and we're going to do our best to reach out and respond to as many of these students as we can. Right now our focus is on making sure the 6,000 of you are settled in, and then we will definitely take the time to communicate with the other students from phase 1. I really wish we could have accepted everyone because there are definitely lots more deserving students who didn't make it in because we had already reached out limit.",
            "track":"n/a"
        },
        {
            "q": "Hi Paul & Joanna, will there be any more Shia LaBeouf motivational videos in Phase 2 ?!!",
            "a": "@Ricardo Varanda  #spoilers.",
            "track":"n/a"
        },
        {
            "q": "Hello it says in the hand book the suggested times are to finish in *8 months* however on the advanced android course we only have *6 months*, so are the suggested times for 8 months or have you changed them for us to help us finish in 6 months thanks!!",
            "a": "@AbbieTurner95 Good question. I don't want to give you an assumption so I'm going to inquire more about this and get back to you once I have a definite answer.",
            "track":"and"
        },
        {
            "q": "Hi! I know phase 1 forums will become read-only in March, but the info on phase 1 Slack workspaces is confusing. We were told they would remain open after 1 month, yet Udacity's email and website tell us they'll be closed after a month. It's just to know if we still have that space available to us to regroup as a community (selected and non-selected students). ",
            "a": "@LaurenM Hey there, so I think it's the wording that's confusing. The Slack group will be closed down on March 6th.",
            "track":"n/a"
        },
        {
            "q": "Should i check in every day with mentor or it's flexible times to access my classroom ?",
            "a": "@Ibrahim It's entirely up to the mentor and how often they think they'll need to check in with you.",
            "track":"n/a"
        },
        {
            "q": "Do people from Mobile Web ND have access to reviews of CV and LinkedIn profile? Where?",
            "a": "@Anna, You have access to the Career portal in your program. It can be found in the  'Extra Curricular' tab in your classroom",
            "track":"mws"
        },
        {
            "q": "is the Google developer challenge a yearly/annual thing?",
            "a": "@Dzengiz Udacity has done it the past two years, and while we have nothing concrete planned for next year, the hope is that it will continue. The best thing to do is to keep your eyes peeled on the Scholarship site which you can find on Udacity's main page.",
            "track":"n/a"
        },
        {
            "q": "Historically what is reasons made some students not not graduate from the ND is it the same criteria in the first phase or what? and what advises for us to get 100% competently understanding and stronger front end developers ?",
            "a": "@Ayman Morsy-FEND Really, it mostly comes down to time management. The first projects are the most important because we have a lot of statistics that show the students who are able to get the first two projects in on time are very likely to successfully finish the ND.",
            "track":"n/a"
        },
        {
            "q": "Will be here too a reverse AMA? ",
            "a":"@JonathanI, Hey! We will do  reverse AMA later on in the program to gather your feedback! Glad you liked the format.",
            "track":"n/a"
        },
        {
            "q": "Hi :slightly_smiling_face: We have a full Nanodegree for 6 months, but is it possible to finish it earlier? Or is it a schedule we have to follow strictly?",
            "a": "@MaevaNAP you can certainly finish earlier if you're up to the challenge.",
            "track":"n/a"
        },
        {
            "q": "Is this a standard Udacity feature to mark previously completed  lessons that overlap across different courses?",
            "a": "@Maciej Beimcik Yep. Just so that you don't end up re-doing lessons needlessly. If you've already completed some work, then it's carried over.",
            "track":"n/a"
        },
        {
            "q": "Do we all have a chat in the classroom? Students from other programs said they have, but I don't. Mine is Android Basics.",
            "a": "Hi @Theatralka ABND has the chat function available for the first two projects. Hope that helps",
            "track":"and"
        },
        {
            "q": "Will there be any official meetups / study groups / events?",
            "a": "@Tom These are normally organized by students and we hope to see all the pictures from your meetups moving forward :smile: There has been discussion ongoing for us to get more involved, officially, but we have nothing to confirm or announce at this time.",
            "track":"n/a"
        },
        {
            "q": "has the issue on the portuguese language being solved? I Know I asked, but I didn't get a response... ",
            "a": "@JaviMar Thanks for bringing this up. We're going to take a look into this to see exactly what might be causing this to happen.",
            "track":"n/a"
        },
        {
            "q": "Is the activity on Slack and Forums still mandatory for obtaining the ND?",
            "a": "Hi @Alina it is not required per say, but Slack and forums have proven to be really helpful to students in their learning.  Similar to the first phase, we loop in all of these community features to help each student have access to peer-learning by bouncing ideas off each other, collaborating and inspiring one another. Additionally, the community managers are here as extra support to help you all successfully finish your course over these next 6 months! ",
            "track":"n/a"
        }
    ]

}
]
